PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.3 *
       3;* Date/Time created: Wed Aug 12 00:15:06 2020                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru1_mcp3208_comm.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.3 Copyright (c) 2012-2018 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/pru-mcp3208-6ch/pru1_mcp3208_comm")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .weak   ||CT_CFG||
      15 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      16$C$DW$1 .dwtag  DW_TAG_variable
      17        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      19        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

     733 000000cc 000000230000C3!         JAL       r3.w2, ||convert||    ; [ALU_PRU] |150| convert
     734 000000d0 0000000901E4E0          LSL       r0, r4, 0x01          ; [ALU_PRU] |150| i
     735 000000d4 00000000E0E5E0          ADD       r0, r5, r0            ; [ALU_PRU] |150| curr_buff
     736 000000d8 000000E108008E          SBBO      &r14.w0, r0, 8, 2     ; [ALU_PRU] |150| 
     737        .dwpsn  file "pru1_mcp3208_comm.c",line 151,column 7,is_stmt,isa 0
     738;----------------------------------------------------------------------
     739; 151 | __delay_cycles(MCP3208_TCSH_CYC);                                      
     740; 154 | // Switch buffers                                                      
     741;----------------------------------------------------------------------
     742        .newblock
     743 000000dc 006387240000C7          LDI32    r7, 99
     744 000000e4 0000000501E7E7  $1:     SUB      r7, r7, 1
     745 000000e8 0000006F00E7FF          QBNE     $1, r7, 0             ; [ALU_PRU] |151| 
     746        .dwpsn  file "pru1_mcp3208_comm.c",line 148,column 15,is_stmt,isa 0
     747 000000ec 00F081248000C1          LDI32     r1, 0x800000f0        ; [ALU_PRU] |148| 
     748 000000f4 0000000101E4E4          ADD       r4, r4, 0x01          ; [ALU_PRU] |148| i,i
     749 000000f8 00000010E4E4E0          MOV       r0, r4                ; [ALU_PRU] |148| i
     750 000000fc 00000015806060          XOR       r0.b3, r0.b3, 0x80    ; [ALU_PRU] |148| 
     751 00000100 0000004EE0E1EE          QBLT      ||$C$L7||, r1, r0     ; [ALU_PRU] |148| 
     752;* --------------------------------------------------------------------------*
     753;*** 155        -----------------------    *K$24 ^= 1u;
     754;*** 156        -----------------------    *K$24 &= 1u;
     755;*** 159        -----------------------    __R31 = 36u;
     756;*** 160        -----------------------    goto g2;
     757        .dwpsn  file "pru1_mcp3208_comm.c",line 155,column 5,is_stmt,isa 0
     758;----------------------------------------------------------------------
     759; 155 | *buffer_index ^= 1;                                                    
     760;----------------------------------------------------------------------
     761 00000104 000000F1000600          LBBO      &r0.b0, r6, 0, 1      ; [ALU_PRU] |155| $O$K24
     762 00000108 00000015010000          XOR       r0.b0, r0.b0, 0x01    ; [ALU_PRU] |155| 
     763 0000010c 000000E1000600          SBBO      &r0.b0, r6, 0, 1      ; [ALU_PRU] |155| $O$K24
     764        .dwpsn  file "pru1_mcp3208_comm.c",line 156,column 5,is_stmt,isa 0
     765;----------------------------------------------------------------------
     766; 156 | *buffer_index &= 1; // For precaution                                  
     767; 158 | // Trigger event                                                       
     768;----------------------------------------------------------------------
     769 00000110 000000F1000600          LBBO      &r0.b0, r6, 0, 1      ; [ALU_PRU] |156| $O$K24
     770 00000114 00000011010000          AND       r0.b0, r0.b0, 0x01    ; [ALU_PRU] |156| 
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   15

     771 00000118 000000E1000600          SBBO      &r0.b0, r6, 0, 1      ; [ALU_PRU] |156| $O$K24
     772        .dwpsn  file "pru1_mcp3208_comm.c",line 159,column 5,is_stmt,isa 0
     773;----------------------------------------------------------------------
     774; 159 | PRU0_PRU1_TRIGGER;                                                     
     775;----------------------------------------------------------------------
     776 0000011c 000000240024FF          LDI       r31, 0x0024           ; [ALU_PRU] |159| 
     777        .dwpsn  file "pru1_mcp3208_comm.c",line 160,column 3,is_stmt,isa 0
     778;----------------------------------------------------------------------
     779; 162 | __halt();                                                              
     780;----------------------------------------------------------------------
     781 00000120 00000021000000!         JMP       ||$C$L6||             ; [ALU_PRU] |160| 
     782;* --------------------------------------------------------------------------*
     783        .dwattr $C$DW$18, DW_AT_TI_end_file("pru1_mcp3208_comm.c")
     784        .dwattr $C$DW$18, DW_AT_TI_end_line(0xa3)
     785        .dwattr $C$DW$18, DW_AT_TI_end_column(0x01)
     786        .dwendentry
     787        .dwendtag $C$DW$18
     788
     789;* Inlined function references:
     790;* [0] start_pru1_timer
     791;* [1] mosi_set
     792;* [2] mosi_clr
     793;* [3] sclk_set
     794;* [4] sclk_clr
     795;* [5] cs_set
     796;* [6] cs_clr
     797;* [7] miso_rd
     798;*****************************************************************************
     799;* UNDEFINED EXTERNAL REFERENCES                                             *
     800;*****************************************************************************
     801        .global ||clock_ns||
     802        .global ||__pruabi_remi||
     803
     804;******************************************************************************
     805;* TYPE INFORMATION                                                           *
     806;******************************************************************************
     807
     808$C$DW$T$19      .dwtag  DW_TAG_structure_type
     809        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     810$C$DW$30        .dwtag  DW_TAG_member
     811        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     812        .dwattr $C$DW$30, DW_AT_name("REVID")
     813        .dwattr $C$DW$30, DW_AT_TI_symbol_name("REVID")
     814        .dwattr $C$DW$30, DW_AT_bit_offset(0x00)
     815        .dwattr $C$DW$30, DW_AT_bit_size(0x20)
     816        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     818        .dwattr $C$DW$30, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     819        .dwattr $C$DW$30, DW_AT_decl_line(0x2d)
     820        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     821
     822        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     823        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     824        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     825        .dwendtag $C$DW$T$19
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   16

     826
     827$C$DW$T$123     .dwtag  DW_TAG_volatile_type
     828        .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
     829
     830
     831$C$DW$T$20      .dwtag  DW_TAG_structure_type
     832        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     833$C$DW$31        .dwtag  DW_TAG_member
     834        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     835        .dwattr $C$DW$31, DW_AT_name("IDLE_MODE")
     836        .dwattr $C$DW$31, DW_AT_TI_symbol_name("IDLE_MODE")
     837        .dwattr $C$DW$31, DW_AT_bit_offset(0x1e)
     838        .dwattr $C$DW$31, DW_AT_bit_size(0x02)
     839        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     841        .dwattr $C$DW$31, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     842        .dwattr $C$DW$31, DW_AT_decl_line(0x37)
     843        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     844
     845$C$DW$32        .dwtag  DW_TAG_member
     846        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     847        .dwattr $C$DW$32, DW_AT_name("STANDBY_MODE")
     848        .dwattr $C$DW$32, DW_AT_TI_symbol_name("STANDBY_MODE")
     849        .dwattr $C$DW$32, DW_AT_bit_offset(0x1c)
     850        .dwattr $C$DW$32, DW_AT_bit_size(0x02)
     851        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     853        .dwattr $C$DW$32, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     854        .dwattr $C$DW$32, DW_AT_decl_line(0x38)
     855        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     856
     857$C$DW$33        .dwtag  DW_TAG_member
     858        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     859        .dwattr $C$DW$33, DW_AT_name("STANDBY_INIT")
     860        .dwattr $C$DW$33, DW_AT_TI_symbol_name("STANDBY_INIT")
     861        .dwattr $C$DW$33, DW_AT_bit_offset(0x1b)
     862        .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     863        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     865        .dwattr $C$DW$33, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     866        .dwattr $C$DW$33, DW_AT_decl_line(0x39)
     867        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     868
     869$C$DW$34        .dwtag  DW_TAG_member
     870        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     871        .dwattr $C$DW$34, DW_AT_name("SUB_MWAIT")
     872        .dwattr $C$DW$34, DW_AT_TI_symbol_name("SUB_MWAIT")
     873        .dwattr $C$DW$34, DW_AT_bit_offset(0x1a)
     874        .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     875        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     877        .dwattr $C$DW$34, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     878        .dwattr $C$DW$34, DW_AT_decl_line(0x3a)
     879        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     880
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   17

     881$C$DW$35        .dwtag  DW_TAG_member
     882        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     883        .dwattr $C$DW$35, DW_AT_name("rsvd6")
     884        .dwattr $C$DW$35, DW_AT_TI_symbol_name("rsvd6")
     885        .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     886        .dwattr $C$DW$35, DW_AT_bit_size(0x1a)
     887        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     889        .dwattr $C$DW$35, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     890        .dwattr $C$DW$35, DW_AT_decl_line(0x3b)
     891        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     892
     893        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     894        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     895        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     896        .dwendtag $C$DW$T$20
     897
     898$C$DW$T$125     .dwtag  DW_TAG_volatile_type
     899        .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$20)
     900
     901
     902$C$DW$T$21      .dwtag  DW_TAG_structure_type
     903        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     904$C$DW$36        .dwtag  DW_TAG_member
     905        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     906        .dwattr $C$DW$36, DW_AT_name("PRU0_GPI_MODE")
     907        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     908        .dwattr $C$DW$36, DW_AT_bit_offset(0x1e)
     909        .dwattr $C$DW$36, DW_AT_bit_size(0x02)
     910        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     912        .dwattr $C$DW$36, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     913        .dwattr $C$DW$36, DW_AT_decl_line(0x45)
     914        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     915
     916$C$DW$37        .dwtag  DW_TAG_member
     917        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     918        .dwattr $C$DW$37, DW_AT_name("PRU0_GPI_CLK_MODE")
     919        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     920        .dwattr $C$DW$37, DW_AT_bit_offset(0x1d)
     921        .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     922        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     924        .dwattr $C$DW$37, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     925        .dwattr $C$DW$37, DW_AT_decl_line(0x46)
     926        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     927
     928$C$DW$38        .dwtag  DW_TAG_member
     929        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     930        .dwattr $C$DW$38, DW_AT_name("PRU0_GPI_DIV0")
     931        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     932        .dwattr $C$DW$38, DW_AT_bit_offset(0x18)
     933        .dwattr $C$DW$38, DW_AT_bit_size(0x05)
     934        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   18

     936        .dwattr $C$DW$38, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     937        .dwattr $C$DW$38, DW_AT_decl_line(0x47)
     938        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     939
     940$C$DW$39        .dwtag  DW_TAG_member
     941        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     942        .dwattr $C$DW$39, DW_AT_name("PRU0_GPI_DIV1")
     943        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     944        .dwattr $C$DW$39, DW_AT_bit_offset(0x13)
     945        .dwattr $C$DW$39, DW_AT_bit_size(0x05)
     946        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     948        .dwattr $C$DW$39, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     949        .dwattr $C$DW$39, DW_AT_decl_line(0x48)
     950        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     951
     952$C$DW$40        .dwtag  DW_TAG_member
     953        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     954        .dwattr $C$DW$40, DW_AT_name("PRU0_GPI_SB")
     955        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     956        .dwattr $C$DW$40, DW_AT_bit_offset(0x12)
     957        .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     958        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     960        .dwattr $C$DW$40, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     961        .dwattr $C$DW$40, DW_AT_decl_line(0x49)
     962        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     963
     964$C$DW$41        .dwtag  DW_TAG_member
     965        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     966        .dwattr $C$DW$41, DW_AT_name("PRU0_GPO_MODE")
     967        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     968        .dwattr $C$DW$41, DW_AT_bit_offset(0x11)
     969        .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     970        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     972        .dwattr $C$DW$41, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     973        .dwattr $C$DW$41, DW_AT_decl_line(0x4a)
     974        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     975
     976$C$DW$42        .dwtag  DW_TAG_member
     977        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     978        .dwattr $C$DW$42, DW_AT_name("PRU0_GPO_DIV0")
     979        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     980        .dwattr $C$DW$42, DW_AT_bit_offset(0x0c)
     981        .dwattr $C$DW$42, DW_AT_bit_size(0x05)
     982        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     984        .dwattr $C$DW$42, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     985        .dwattr $C$DW$42, DW_AT_decl_line(0x4b)
     986        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     987
     988$C$DW$43        .dwtag  DW_TAG_member
     989        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     990        .dwattr $C$DW$43, DW_AT_name("PRU0_GPO_DIV1")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   19

     991        .dwattr $C$DW$43, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     992        .dwattr $C$DW$43, DW_AT_bit_offset(0x07)
     993        .dwattr $C$DW$43, DW_AT_bit_size(0x05)
     994        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     996        .dwattr $C$DW$43, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     997        .dwattr $C$DW$43, DW_AT_decl_line(0x4c)
     998        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     999
    1000$C$DW$44        .dwtag  DW_TAG_member
    1001        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
    1002        .dwattr $C$DW$44, DW_AT_name("PRU0_GPO_SH_SEL")
    1003        .dwattr $C$DW$44, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1004        .dwattr $C$DW$44, DW_AT_bit_offset(0x06)
    1005        .dwattr $C$DW$44, DW_AT_bit_size(0x01)
    1006        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1008        .dwattr $C$DW$44, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1009        .dwattr $C$DW$44, DW_AT_decl_line(0x4d)
    1010        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1011
    1012$C$DW$45        .dwtag  DW_TAG_member
    1013        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
    1014        .dwattr $C$DW$45, DW_AT_name("rsvd26")
    1015        .dwattr $C$DW$45, DW_AT_TI_symbol_name("rsvd26")
    1016        .dwattr $C$DW$45, DW_AT_bit_offset(0x00)
    1017        .dwattr $C$DW$45, DW_AT_bit_size(0x06)
    1018        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1020        .dwattr $C$DW$45, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1021        .dwattr $C$DW$45, DW_AT_decl_line(0x4e)
    1022        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1023
    1024        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1025        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1026        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1027        .dwendtag $C$DW$T$21
    1028
    1029$C$DW$T$127     .dwtag  DW_TAG_volatile_type
    1030        .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$21)
    1031
    1032
    1033$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1034        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1035$C$DW$46        .dwtag  DW_TAG_member
    1036        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
    1037        .dwattr $C$DW$46, DW_AT_name("PRU1_GPI_MODE")
    1038        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1039        .dwattr $C$DW$46, DW_AT_bit_offset(0x1e)
    1040        .dwattr $C$DW$46, DW_AT_bit_size(0x02)
    1041        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1043        .dwattr $C$DW$46, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1044        .dwattr $C$DW$46, DW_AT_decl_line(0x58)
    1045        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   20

    1046
    1047$C$DW$47        .dwtag  DW_TAG_member
    1048        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
    1049        .dwattr $C$DW$47, DW_AT_name("PRU1_GPI_CLK_MODE")
    1050        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1051        .dwattr $C$DW$47, DW_AT_bit_offset(0x1d)
    1052        .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1053        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1055        .dwattr $C$DW$47, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1056        .dwattr $C$DW$47, DW_AT_decl_line(0x59)
    1057        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
    1058
    1059$C$DW$48        .dwtag  DW_TAG_member
    1060        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
    1061        .dwattr $C$DW$48, DW_AT_name("PRU1_GPI_DIV0")
    1062        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1063        .dwattr $C$DW$48, DW_AT_bit_offset(0x18)
    1064        .dwattr $C$DW$48, DW_AT_bit_size(0x05)
    1065        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1067        .dwattr $C$DW$48, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1068        .dwattr $C$DW$48, DW_AT_decl_line(0x5a)
    1069        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
    1070
    1071$C$DW$49        .dwtag  DW_TAG_member
    1072        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
    1073        .dwattr $C$DW$49, DW_AT_name("PRU1_GPI_DIV1")
    1074        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1075        .dwattr $C$DW$49, DW_AT_bit_offset(0x13)
    1076        .dwattr $C$DW$49, DW_AT_bit_size(0x05)
    1077        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1079        .dwattr $C$DW$49, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1080        .dwattr $C$DW$49, DW_AT_decl_line(0x5b)
    1081        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1082
    1083$C$DW$50        .dwtag  DW_TAG_member
    1084        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
    1085        .dwattr $C$DW$50, DW_AT_name("PRU1_GPI_SB")
    1086        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1087        .dwattr $C$DW$50, DW_AT_bit_offset(0x12)
    1088        .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1089        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1091        .dwattr $C$DW$50, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1092        .dwattr $C$DW$50, DW_AT_decl_line(0x5c)
    1093        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
    1094
    1095$C$DW$51        .dwtag  DW_TAG_member
    1096        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
    1097        .dwattr $C$DW$51, DW_AT_name("PRU1_GPO_MODE")
    1098        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1099        .dwattr $C$DW$51, DW_AT_bit_offset(0x11)
    1100        .dwattr $C$DW$51, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   21

    1101        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$51, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1104        .dwattr $C$DW$51, DW_AT_decl_line(0x5d)
    1105        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
    1106
    1107$C$DW$52        .dwtag  DW_TAG_member
    1108        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
    1109        .dwattr $C$DW$52, DW_AT_name("PRU1_GPO_DIV0")
    1110        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1111        .dwattr $C$DW$52, DW_AT_bit_offset(0x0c)
    1112        .dwattr $C$DW$52, DW_AT_bit_size(0x05)
    1113        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1115        .dwattr $C$DW$52, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1116        .dwattr $C$DW$52, DW_AT_decl_line(0x5e)
    1117        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1118
    1119$C$DW$53        .dwtag  DW_TAG_member
    1120        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
    1121        .dwattr $C$DW$53, DW_AT_name("PRU1_GPO_DIV1")
    1122        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1123        .dwattr $C$DW$53, DW_AT_bit_offset(0x07)
    1124        .dwattr $C$DW$53, DW_AT_bit_size(0x05)
    1125        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1127        .dwattr $C$DW$53, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1128        .dwattr $C$DW$53, DW_AT_decl_line(0x5f)
    1129        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
    1130
    1131$C$DW$54        .dwtag  DW_TAG_member
    1132        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
    1133        .dwattr $C$DW$54, DW_AT_name("PRU1_GPO_SH_SEL")
    1134        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1135        .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
    1136        .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1137        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1139        .dwattr $C$DW$54, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1140        .dwattr $C$DW$54, DW_AT_decl_line(0x60)
    1141        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
    1142
    1143$C$DW$55        .dwtag  DW_TAG_member
    1144        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
    1145        .dwattr $C$DW$55, DW_AT_name("rsvd26")
    1146        .dwattr $C$DW$55, DW_AT_TI_symbol_name("rsvd26")
    1147        .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
    1148        .dwattr $C$DW$55, DW_AT_bit_size(0x06)
    1149        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1151        .dwattr $C$DW$55, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1152        .dwattr $C$DW$55, DW_AT_decl_line(0x61)
    1153        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1154
    1155        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   22

    1156        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1157        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1158        .dwendtag $C$DW$T$22
    1159
    1160$C$DW$T$129     .dwtag  DW_TAG_volatile_type
    1161        .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$22)
    1162
    1163
    1164$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1165        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1166$C$DW$56        .dwtag  DW_TAG_member
    1167        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
    1168        .dwattr $C$DW$56, DW_AT_name("PRU0_CLK_STOP_REQ")
    1169        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1170        .dwattr $C$DW$56, DW_AT_bit_offset(0x1f)
    1171        .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1172        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1174        .dwattr $C$DW$56, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1175        .dwattr $C$DW$56, DW_AT_decl_line(0x6b)
    1176        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1177
    1178$C$DW$57        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
    1180        .dwattr $C$DW$57, DW_AT_name("PRU0_CLK_STOP_ACK")
    1181        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1182        .dwattr $C$DW$57, DW_AT_bit_offset(0x1e)
    1183        .dwattr $C$DW$57, DW_AT_bit_size(0x01)
    1184        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$57, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1187        .dwattr $C$DW$57, DW_AT_decl_line(0x6c)
    1188        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1189
    1190$C$DW$58        .dwtag  DW_TAG_member
    1191        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
    1192        .dwattr $C$DW$58, DW_AT_name("PRU0_CLK_EN")
    1193        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1194        .dwattr $C$DW$58, DW_AT_bit_offset(0x1d)
    1195        .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1196        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1198        .dwattr $C$DW$58, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1199        .dwattr $C$DW$58, DW_AT_decl_line(0x6d)
    1200        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1201
    1202$C$DW$59        .dwtag  DW_TAG_member
    1203        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
    1204        .dwattr $C$DW$59, DW_AT_name("PRU1_CLK_STOP_REQ")
    1205        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1206        .dwattr $C$DW$59, DW_AT_bit_offset(0x1c)
    1207        .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1208        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1210        .dwattr $C$DW$59, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   23

    1211        .dwattr $C$DW$59, DW_AT_decl_line(0x6e)
    1212        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1213
    1214$C$DW$60        .dwtag  DW_TAG_member
    1215        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
    1216        .dwattr $C$DW$60, DW_AT_name("PRU1_CLK_STOP_ACK")
    1217        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1218        .dwattr $C$DW$60, DW_AT_bit_offset(0x1b)
    1219        .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1220        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1222        .dwattr $C$DW$60, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1223        .dwattr $C$DW$60, DW_AT_decl_line(0x6f)
    1224        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1225
    1226$C$DW$61        .dwtag  DW_TAG_member
    1227        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
    1228        .dwattr $C$DW$61, DW_AT_name("PRU1_CLK_EN")
    1229        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1230        .dwattr $C$DW$61, DW_AT_bit_offset(0x1a)
    1231        .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1232        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1234        .dwattr $C$DW$61, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1235        .dwattr $C$DW$61, DW_AT_decl_line(0x70)
    1236        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1237
    1238$C$DW$62        .dwtag  DW_TAG_member
    1239        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
    1240        .dwattr $C$DW$62, DW_AT_name("INTC_CLK_STOP_REQ")
    1241        .dwattr $C$DW$62, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1242        .dwattr $C$DW$62, DW_AT_bit_offset(0x19)
    1243        .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1244        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$62, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1247        .dwattr $C$DW$62, DW_AT_decl_line(0x71)
    1248        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1249
    1250$C$DW$63        .dwtag  DW_TAG_member
    1251        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1252        .dwattr $C$DW$63, DW_AT_name("INTC_CLK_STOP_ACK")
    1253        .dwattr $C$DW$63, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1254        .dwattr $C$DW$63, DW_AT_bit_offset(0x18)
    1255        .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1256        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1258        .dwattr $C$DW$63, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1259        .dwattr $C$DW$63, DW_AT_decl_line(0x72)
    1260        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1261
    1262$C$DW$64        .dwtag  DW_TAG_member
    1263        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
    1264        .dwattr $C$DW$64, DW_AT_name("INTC_CLK_EN")
    1265        .dwattr $C$DW$64, DW_AT_TI_symbol_name("INTC_CLK_EN")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   24

    1266        .dwattr $C$DW$64, DW_AT_bit_offset(0x17)
    1267        .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1268        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1270        .dwattr $C$DW$64, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1271        .dwattr $C$DW$64, DW_AT_decl_line(0x73)
    1272        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1273
    1274$C$DW$65        .dwtag  DW_TAG_member
    1275        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1276        .dwattr $C$DW$65, DW_AT_name("UART_CLK_STOP_REQ")
    1277        .dwattr $C$DW$65, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1278        .dwattr $C$DW$65, DW_AT_bit_offset(0x16)
    1279        .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1280        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1282        .dwattr $C$DW$65, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1283        .dwattr $C$DW$65, DW_AT_decl_line(0x74)
    1284        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1285
    1286$C$DW$66        .dwtag  DW_TAG_member
    1287        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1288        .dwattr $C$DW$66, DW_AT_name("UART_CLK_STOP_ACK")
    1289        .dwattr $C$DW$66, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1290        .dwattr $C$DW$66, DW_AT_bit_offset(0x15)
    1291        .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1292        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1294        .dwattr $C$DW$66, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1295        .dwattr $C$DW$66, DW_AT_decl_line(0x75)
    1296        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1297
    1298$C$DW$67        .dwtag  DW_TAG_member
    1299        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1300        .dwattr $C$DW$67, DW_AT_name("UART_CLK_EN")
    1301        .dwattr $C$DW$67, DW_AT_TI_symbol_name("UART_CLK_EN")
    1302        .dwattr $C$DW$67, DW_AT_bit_offset(0x14)
    1303        .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1304        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1306        .dwattr $C$DW$67, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1307        .dwattr $C$DW$67, DW_AT_decl_line(0x76)
    1308        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1309
    1310$C$DW$68        .dwtag  DW_TAG_member
    1311        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1312        .dwattr $C$DW$68, DW_AT_name("ECAP_CLK_STOP_REQ")
    1313        .dwattr $C$DW$68, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1314        .dwattr $C$DW$68, DW_AT_bit_offset(0x13)
    1315        .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1316        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1318        .dwattr $C$DW$68, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1319        .dwattr $C$DW$68, DW_AT_decl_line(0x77)
    1320        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   25

    1321
    1322$C$DW$69        .dwtag  DW_TAG_member
    1323        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1324        .dwattr $C$DW$69, DW_AT_name("ECAP_CLK_STOP_ACK")
    1325        .dwattr $C$DW$69, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1326        .dwattr $C$DW$69, DW_AT_bit_offset(0x12)
    1327        .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1328        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1330        .dwattr $C$DW$69, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1331        .dwattr $C$DW$69, DW_AT_decl_line(0x78)
    1332        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1333
    1334$C$DW$70        .dwtag  DW_TAG_member
    1335        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1336        .dwattr $C$DW$70, DW_AT_name("ECAP_CLK_EN")
    1337        .dwattr $C$DW$70, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1338        .dwattr $C$DW$70, DW_AT_bit_offset(0x11)
    1339        .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1340        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1342        .dwattr $C$DW$70, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1343        .dwattr $C$DW$70, DW_AT_decl_line(0x79)
    1344        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1345
    1346$C$DW$71        .dwtag  DW_TAG_member
    1347        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1348        .dwattr $C$DW$71, DW_AT_name("IEP_CLK_STOP_REQ")
    1349        .dwattr $C$DW$71, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1350        .dwattr $C$DW$71, DW_AT_bit_offset(0x10)
    1351        .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1352        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1354        .dwattr $C$DW$71, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1355        .dwattr $C$DW$71, DW_AT_decl_line(0x7a)
    1356        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1357
    1358$C$DW$72        .dwtag  DW_TAG_member
    1359        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1360        .dwattr $C$DW$72, DW_AT_name("IEP_CLK_STOP_ACK")
    1361        .dwattr $C$DW$72, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1362        .dwattr $C$DW$72, DW_AT_bit_offset(0x0f)
    1363        .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1364        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1366        .dwattr $C$DW$72, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1367        .dwattr $C$DW$72, DW_AT_decl_line(0x7b)
    1368        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1369
    1370$C$DW$73        .dwtag  DW_TAG_member
    1371        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1372        .dwattr $C$DW$73, DW_AT_name("IEP_CLK_EN")
    1373        .dwattr $C$DW$73, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1374        .dwattr $C$DW$73, DW_AT_bit_offset(0x0e)
    1375        .dwattr $C$DW$73, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   26

    1376        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1378        .dwattr $C$DW$73, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1379        .dwattr $C$DW$73, DW_AT_decl_line(0x7c)
    1380        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1381
    1382$C$DW$74        .dwtag  DW_TAG_member
    1383        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1384        .dwattr $C$DW$74, DW_AT_name("rsvd18")
    1385        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd18")
    1386        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1387        .dwattr $C$DW$74, DW_AT_bit_size(0x0e)
    1388        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1390        .dwattr $C$DW$74, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1391        .dwattr $C$DW$74, DW_AT_decl_line(0x7d)
    1392        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1393
    1394        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1395        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1396        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1397        .dwendtag $C$DW$T$23
    1398
    1399$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1400        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$23)
    1401
    1402
    1403$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1404        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1405$C$DW$75        .dwtag  DW_TAG_member
    1406        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1407        .dwattr $C$DW$75, DW_AT_name("PRU0_IMEM_PE_RAW")
    1408        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1409        .dwattr $C$DW$75, DW_AT_bit_offset(0x1c)
    1410        .dwattr $C$DW$75, DW_AT_bit_size(0x04)
    1411        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1413        .dwattr $C$DW$75, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1414        .dwattr $C$DW$75, DW_AT_decl_line(0x87)
    1415        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1416
    1417$C$DW$76        .dwtag  DW_TAG_member
    1418        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1419        .dwattr $C$DW$76, DW_AT_name("PRU0_DMEM_PE_RAW")
    1420        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1421        .dwattr $C$DW$76, DW_AT_bit_offset(0x18)
    1422        .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1423        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1425        .dwattr $C$DW$76, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1426        .dwattr $C$DW$76, DW_AT_decl_line(0x88)
    1427        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1428
    1429$C$DW$77        .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   27

    1431        .dwattr $C$DW$77, DW_AT_name("PRU1_IMEM_PE_RAW")
    1432        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1433        .dwattr $C$DW$77, DW_AT_bit_offset(0x14)
    1434        .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1435        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1437        .dwattr $C$DW$77, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1438        .dwattr $C$DW$77, DW_AT_decl_line(0x89)
    1439        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1440
    1441$C$DW$78        .dwtag  DW_TAG_member
    1442        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1443        .dwattr $C$DW$78, DW_AT_name("PRU1_DMEM_PE_RAW")
    1444        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1445        .dwattr $C$DW$78, DW_AT_bit_offset(0x10)
    1446        .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1447        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1449        .dwattr $C$DW$78, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1450        .dwattr $C$DW$78, DW_AT_decl_line(0x8a)
    1451        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1452
    1453$C$DW$79        .dwtag  DW_TAG_member
    1454        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1455        .dwattr $C$DW$79, DW_AT_name("RAM_PE_RAW")
    1456        .dwattr $C$DW$79, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1457        .dwattr $C$DW$79, DW_AT_bit_offset(0x0c)
    1458        .dwattr $C$DW$79, DW_AT_bit_size(0x04)
    1459        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1461        .dwattr $C$DW$79, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1462        .dwattr $C$DW$79, DW_AT_decl_line(0x8b)
    1463        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1464
    1465$C$DW$80        .dwtag  DW_TAG_member
    1466        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1467        .dwattr $C$DW$80, DW_AT_name("rsvd20")
    1468        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd20")
    1469        .dwattr $C$DW$80, DW_AT_bit_offset(0x00)
    1470        .dwattr $C$DW$80, DW_AT_bit_size(0x0c)
    1471        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1473        .dwattr $C$DW$80, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1474        .dwattr $C$DW$80, DW_AT_decl_line(0x8c)
    1475        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1476
    1477        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1478        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1479        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1480        .dwendtag $C$DW$T$24
    1481
    1482$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1483        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$24)
    1484
    1485
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   28

    1486$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1487        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1488$C$DW$81        .dwtag  DW_TAG_member
    1489        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1490        .dwattr $C$DW$81, DW_AT_name("PRU0_IMEM_PE")
    1491        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1492        .dwattr $C$DW$81, DW_AT_bit_offset(0x1c)
    1493        .dwattr $C$DW$81, DW_AT_bit_size(0x04)
    1494        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1496        .dwattr $C$DW$81, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1497        .dwattr $C$DW$81, DW_AT_decl_line(0x96)
    1498        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1499
    1500$C$DW$82        .dwtag  DW_TAG_member
    1501        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1502        .dwattr $C$DW$82, DW_AT_name("PRU0_DMEM_PE")
    1503        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1504        .dwattr $C$DW$82, DW_AT_bit_offset(0x18)
    1505        .dwattr $C$DW$82, DW_AT_bit_size(0x04)
    1506        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1508        .dwattr $C$DW$82, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1509        .dwattr $C$DW$82, DW_AT_decl_line(0x97)
    1510        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1511
    1512$C$DW$83        .dwtag  DW_TAG_member
    1513        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1514        .dwattr $C$DW$83, DW_AT_name("PRU1_IMEM_PE")
    1515        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1516        .dwattr $C$DW$83, DW_AT_bit_offset(0x14)
    1517        .dwattr $C$DW$83, DW_AT_bit_size(0x04)
    1518        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1520        .dwattr $C$DW$83, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1521        .dwattr $C$DW$83, DW_AT_decl_line(0x98)
    1522        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1523
    1524$C$DW$84        .dwtag  DW_TAG_member
    1525        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1526        .dwattr $C$DW$84, DW_AT_name("PRU1_DMEM_PE")
    1527        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1528        .dwattr $C$DW$84, DW_AT_bit_offset(0x10)
    1529        .dwattr $C$DW$84, DW_AT_bit_size(0x04)
    1530        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1532        .dwattr $C$DW$84, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1533        .dwattr $C$DW$84, DW_AT_decl_line(0x99)
    1534        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1535
    1536$C$DW$85        .dwtag  DW_TAG_member
    1537        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1538        .dwattr $C$DW$85, DW_AT_name("RAM_PE")
    1539        .dwattr $C$DW$85, DW_AT_TI_symbol_name("RAM_PE")
    1540        .dwattr $C$DW$85, DW_AT_bit_offset(0x0c)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   29

    1541        .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1542        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1544        .dwattr $C$DW$85, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1545        .dwattr $C$DW$85, DW_AT_decl_line(0x9a)
    1546        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1547
    1548$C$DW$86        .dwtag  DW_TAG_member
    1549        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1550        .dwattr $C$DW$86, DW_AT_name("rsvd20")
    1551        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd20")
    1552        .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1553        .dwattr $C$DW$86, DW_AT_bit_size(0x0c)
    1554        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1556        .dwattr $C$DW$86, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1557        .dwattr $C$DW$86, DW_AT_decl_line(0x9b)
    1558        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1559
    1560        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1561        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1562        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1563        .dwendtag $C$DW$T$25
    1564
    1565$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1566        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$25)
    1567
    1568
    1569$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1570        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1571$C$DW$87        .dwtag  DW_TAG_member
    1572        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1573        .dwattr $C$DW$87, DW_AT_name("PRU0_IMEM_PE_SET")
    1574        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1575        .dwattr $C$DW$87, DW_AT_bit_offset(0x1c)
    1576        .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1577        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1579        .dwattr $C$DW$87, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1580        .dwattr $C$DW$87, DW_AT_decl_line(0xa4)
    1581        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1582
    1583$C$DW$88        .dwtag  DW_TAG_member
    1584        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1585        .dwattr $C$DW$88, DW_AT_name("PRU0_DMEM_PE_SET")
    1586        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1587        .dwattr $C$DW$88, DW_AT_bit_offset(0x18)
    1588        .dwattr $C$DW$88, DW_AT_bit_size(0x04)
    1589        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1591        .dwattr $C$DW$88, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1592        .dwattr $C$DW$88, DW_AT_decl_line(0xa5)
    1593        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1594
    1595$C$DW$89        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   30

    1596        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1597        .dwattr $C$DW$89, DW_AT_name("PRU1_IMEM_PE_SET")
    1598        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1599        .dwattr $C$DW$89, DW_AT_bit_offset(0x14)
    1600        .dwattr $C$DW$89, DW_AT_bit_size(0x04)
    1601        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$89, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1604        .dwattr $C$DW$89, DW_AT_decl_line(0xa6)
    1605        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1606
    1607$C$DW$90        .dwtag  DW_TAG_member
    1608        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1609        .dwattr $C$DW$90, DW_AT_name("PRU1_DMEM_PE_SET")
    1610        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1611        .dwattr $C$DW$90, DW_AT_bit_offset(0x10)
    1612        .dwattr $C$DW$90, DW_AT_bit_size(0x04)
    1613        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1615        .dwattr $C$DW$90, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1616        .dwattr $C$DW$90, DW_AT_decl_line(0xa7)
    1617        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1618
    1619$C$DW$91        .dwtag  DW_TAG_member
    1620        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1621        .dwattr $C$DW$91, DW_AT_name("RAM_PE_SET")
    1622        .dwattr $C$DW$91, DW_AT_TI_symbol_name("RAM_PE_SET")
    1623        .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1624        .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1625        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1627        .dwattr $C$DW$91, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1628        .dwattr $C$DW$91, DW_AT_decl_line(0xa8)
    1629        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1630
    1631$C$DW$92        .dwtag  DW_TAG_member
    1632        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1633        .dwattr $C$DW$92, DW_AT_name("rsvd20")
    1634        .dwattr $C$DW$92, DW_AT_TI_symbol_name("rsvd20")
    1635        .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1636        .dwattr $C$DW$92, DW_AT_bit_size(0x0c)
    1637        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1639        .dwattr $C$DW$92, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1640        .dwattr $C$DW$92, DW_AT_decl_line(0xa9)
    1641        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1642
    1643        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1644        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1645        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1646        .dwendtag $C$DW$T$26
    1647
    1648$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1649        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$26)
    1650
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   31

    1651
    1652$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1653        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1654$C$DW$93        .dwtag  DW_TAG_member
    1655        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1656        .dwattr $C$DW$93, DW_AT_name("PRU0_IMEM_PE_CLR")
    1657        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1658        .dwattr $C$DW$93, DW_AT_bit_offset(0x1c)
    1659        .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1660        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1662        .dwattr $C$DW$93, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1663        .dwattr $C$DW$93, DW_AT_decl_line(0xb3)
    1664        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1665
    1666$C$DW$94        .dwtag  DW_TAG_member
    1667        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1668        .dwattr $C$DW$94, DW_AT_name("PRU0_DMEM_PE_CLR")
    1669        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1670        .dwattr $C$DW$94, DW_AT_bit_offset(0x18)
    1671        .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1672        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1674        .dwattr $C$DW$94, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1675        .dwattr $C$DW$94, DW_AT_decl_line(0xb4)
    1676        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1677
    1678$C$DW$95        .dwtag  DW_TAG_member
    1679        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1680        .dwattr $C$DW$95, DW_AT_name("PRU1_IMEM_PE_CLR")
    1681        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1682        .dwattr $C$DW$95, DW_AT_bit_offset(0x14)
    1683        .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1684        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1686        .dwattr $C$DW$95, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1687        .dwattr $C$DW$95, DW_AT_decl_line(0xb5)
    1688        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1689
    1690$C$DW$96        .dwtag  DW_TAG_member
    1691        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1692        .dwattr $C$DW$96, DW_AT_name("PRU1_DMEM_PE_CLR")
    1693        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1694        .dwattr $C$DW$96, DW_AT_bit_offset(0x10)
    1695        .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1696        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1698        .dwattr $C$DW$96, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1699        .dwattr $C$DW$96, DW_AT_decl_line(0xb6)
    1700        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1701
    1702$C$DW$97        .dwtag  DW_TAG_member
    1703        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1704        .dwattr $C$DW$97, DW_AT_name("rsvd16")
    1705        .dwattr $C$DW$97, DW_AT_TI_symbol_name("rsvd16")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   32

    1706        .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1707        .dwattr $C$DW$97, DW_AT_bit_size(0x10)
    1708        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1710        .dwattr $C$DW$97, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1711        .dwattr $C$DW$97, DW_AT_decl_line(0xb7)
    1712        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1713
    1714        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1715        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1716        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1717        .dwendtag $C$DW$T$27
    1718
    1719$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1720        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$27)
    1721
    1722
    1723$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1724        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1725$C$DW$98        .dwtag  DW_TAG_member
    1726        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1727        .dwattr $C$DW$98, DW_AT_name("PMAO_PRU0")
    1728        .dwattr $C$DW$98, DW_AT_TI_symbol_name("PMAO_PRU0")
    1729        .dwattr $C$DW$98, DW_AT_bit_offset(0x1f)
    1730        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1731        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1733        .dwattr $C$DW$98, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1734        .dwattr $C$DW$98, DW_AT_decl_line(0xc4)
    1735        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1736
    1737$C$DW$99        .dwtag  DW_TAG_member
    1738        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1739        .dwattr $C$DW$99, DW_AT_name("PMAO_PRU1")
    1740        .dwattr $C$DW$99, DW_AT_TI_symbol_name("PMAO_PRU1")
    1741        .dwattr $C$DW$99, DW_AT_bit_offset(0x1e)
    1742        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1743        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1745        .dwattr $C$DW$99, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1746        .dwattr $C$DW$99, DW_AT_decl_line(0xc5)
    1747        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1748
    1749$C$DW$100       .dwtag  DW_TAG_member
    1750        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1751        .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1752        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd2")
    1753        .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1754        .dwattr $C$DW$100, DW_AT_bit_size(0x1e)
    1755        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1757        .dwattr $C$DW$100, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1758        .dwattr $C$DW$100, DW_AT_decl_line(0xc6)
    1759        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1760
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   33

    1761        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1762        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1763        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1764        .dwendtag $C$DW$T$28
    1765
    1766$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    1767        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$28)
    1768
    1769
    1770$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1771        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1772$C$DW$101       .dwtag  DW_TAG_member
    1773        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1774        .dwattr $C$DW$101, DW_AT_name("OCP_EN")
    1775        .dwattr $C$DW$101, DW_AT_TI_symbol_name("OCP_EN")
    1776        .dwattr $C$DW$101, DW_AT_bit_offset(0x1f)
    1777        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1778        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1780        .dwattr $C$DW$101, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1781        .dwattr $C$DW$101, DW_AT_decl_line(0xd3)
    1782        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1783
    1784$C$DW$102       .dwtag  DW_TAG_member
    1785        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1786        .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1787        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd1")
    1788        .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1789        .dwattr $C$DW$102, DW_AT_bit_size(0x1f)
    1790        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1791        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1792        .dwattr $C$DW$102, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1793        .dwattr $C$DW$102, DW_AT_decl_line(0xd4)
    1794        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1795
    1796        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1797        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1798        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1799        .dwendtag $C$DW$T$29
    1800
    1801$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    1802        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$29)
    1803
    1804
    1805$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1806        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1807$C$DW$103       .dwtag  DW_TAG_member
    1808        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1809        .dwattr $C$DW$103, DW_AT_name("PRU1_PAD_HP_EN")
    1810        .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1811        .dwattr $C$DW$103, DW_AT_bit_offset(0x1f)
    1812        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1813        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1815        .dwattr $C$DW$103, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   34

    1816        .dwattr $C$DW$103, DW_AT_decl_line(0xde)
    1817        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1818
    1819$C$DW$104       .dwtag  DW_TAG_member
    1820        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1821        .dwattr $C$DW$104, DW_AT_name("XFR_SHIFT_EN")
    1822        .dwattr $C$DW$104, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1823        .dwattr $C$DW$104, DW_AT_bit_offset(0x1e)
    1824        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1825        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1827        .dwattr $C$DW$104, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1828        .dwattr $C$DW$104, DW_AT_decl_line(0xdf)
    1829        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1830
    1831$C$DW$105       .dwtag  DW_TAG_member
    1832        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1833        .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1834        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd2")
    1835        .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1836        .dwattr $C$DW$105, DW_AT_bit_size(0x1e)
    1837        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1838        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1839        .dwattr $C$DW$105, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1840        .dwattr $C$DW$105, DW_AT_decl_line(0xe0)
    1841        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1842
    1843        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1844        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1845        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1846        .dwendtag $C$DW$T$30
    1847
    1848$C$DW$T$145     .dwtag  DW_TAG_volatile_type
    1849        .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$30)
    1850
    1851
    1852$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1853        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1854$C$DW$106       .dwtag  DW_TAG_member
    1855        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1856        .dwattr $C$DW$106, DW_AT_name("PIN_MUX_SEL")
    1857        .dwattr $C$DW$106, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1858        .dwattr $C$DW$106, DW_AT_bit_offset(0x18)
    1859        .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    1860        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1862        .dwattr $C$DW$106, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1863        .dwattr $C$DW$106, DW_AT_decl_line(0xec)
    1864        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1865
    1866$C$DW$107       .dwtag  DW_TAG_member
    1867        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1868        .dwattr $C$DW$107, DW_AT_name("rsvd2")
    1869        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd2")
    1870        .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   35

    1871        .dwattr $C$DW$107, DW_AT_bit_size(0x18)
    1872        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1874        .dwattr $C$DW$107, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1875        .dwattr $C$DW$107, DW_AT_decl_line(0xed)
    1876        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1877
    1878        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1879        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1880        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1881        .dwendtag $C$DW$T$31
    1882
    1883$C$DW$T$147     .dwtag  DW_TAG_volatile_type
    1884        .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$31)
    1885
    1886
    1887$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1888        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1889$C$DW$108       .dwtag  DW_TAG_member
    1890        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$124)
    1891        .dwattr $C$DW$108, DW_AT_name("$P$T0")
    1892        .dwattr $C$DW$108, DW_AT_TI_symbol_name("$P$T0")
    1893        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1895        .dwattr $C$DW$108, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1896        .dwattr $C$DW$108, DW_AT_decl_line(0x29)
    1897        .dwattr $C$DW$108, DW_AT_decl_column(0x02)
    1898
    1899$C$DW$109       .dwtag  DW_TAG_member
    1900        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$126)
    1901        .dwattr $C$DW$109, DW_AT_name("$P$T1")
    1902        .dwattr $C$DW$109, DW_AT_TI_symbol_name("$P$T1")
    1903        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1904        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1905        .dwattr $C$DW$109, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1906        .dwattr $C$DW$109, DW_AT_decl_line(0x33)
    1907        .dwattr $C$DW$109, DW_AT_decl_column(0x02)
    1908
    1909$C$DW$110       .dwtag  DW_TAG_member
    1910        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$128)
    1911        .dwattr $C$DW$110, DW_AT_name("$P$T2")
    1912        .dwattr $C$DW$110, DW_AT_TI_symbol_name("$P$T2")
    1913        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1914        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1915        .dwattr $C$DW$110, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1916        .dwattr $C$DW$110, DW_AT_decl_line(0x41)
    1917        .dwattr $C$DW$110, DW_AT_decl_column(0x02)
    1918
    1919$C$DW$111       .dwtag  DW_TAG_member
    1920        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$130)
    1921        .dwattr $C$DW$111, DW_AT_name("$P$T3")
    1922        .dwattr $C$DW$111, DW_AT_TI_symbol_name("$P$T3")
    1923        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1924        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1925        .dwattr $C$DW$111, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   36

    1926        .dwattr $C$DW$111, DW_AT_decl_line(0x54)
    1927        .dwattr $C$DW$111, DW_AT_decl_column(0x02)
    1928
    1929$C$DW$112       .dwtag  DW_TAG_member
    1930        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$132)
    1931        .dwattr $C$DW$112, DW_AT_name("$P$T4")
    1932        .dwattr $C$DW$112, DW_AT_TI_symbol_name("$P$T4")
    1933        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1934        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1935        .dwattr $C$DW$112, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1936        .dwattr $C$DW$112, DW_AT_decl_line(0x67)
    1937        .dwattr $C$DW$112, DW_AT_decl_column(0x02)
    1938
    1939$C$DW$113       .dwtag  DW_TAG_member
    1940        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$134)
    1941        .dwattr $C$DW$113, DW_AT_name("$P$T5")
    1942        .dwattr $C$DW$113, DW_AT_TI_symbol_name("$P$T5")
    1943        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1944        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1945        .dwattr $C$DW$113, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1946        .dwattr $C$DW$113, DW_AT_decl_line(0x83)
    1947        .dwattr $C$DW$113, DW_AT_decl_column(0x02)
    1948
    1949$C$DW$114       .dwtag  DW_TAG_member
    1950        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$136)
    1951        .dwattr $C$DW$114, DW_AT_name("$P$T6")
    1952        .dwattr $C$DW$114, DW_AT_TI_symbol_name("$P$T6")
    1953        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1954        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1955        .dwattr $C$DW$114, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1956        .dwattr $C$DW$114, DW_AT_decl_line(0x92)
    1957        .dwattr $C$DW$114, DW_AT_decl_column(0x02)
    1958
    1959$C$DW$115       .dwtag  DW_TAG_member
    1960        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$138)
    1961        .dwattr $C$DW$115, DW_AT_name("$P$T7")
    1962        .dwattr $C$DW$115, DW_AT_TI_symbol_name("$P$T7")
    1963        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1964        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1965        .dwattr $C$DW$115, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1966        .dwattr $C$DW$115, DW_AT_decl_line(0xa0)
    1967        .dwattr $C$DW$115, DW_AT_decl_column(0x02)
    1968
    1969$C$DW$116       .dwtag  DW_TAG_member
    1970        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$140)
    1971        .dwattr $C$DW$116, DW_AT_name("$P$T8")
    1972        .dwattr $C$DW$116, DW_AT_TI_symbol_name("$P$T8")
    1973        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1974        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1975        .dwattr $C$DW$116, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1976        .dwattr $C$DW$116, DW_AT_decl_line(0xaf)
    1977        .dwattr $C$DW$116, DW_AT_decl_column(0x02)
    1978
    1979$C$DW$117       .dwtag  DW_TAG_member
    1980        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   37

    1981        .dwattr $C$DW$117, DW_AT_name("rsvd24")
    1982        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd24")
    1983        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1984        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1985        .dwattr $C$DW$117, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1986        .dwattr $C$DW$117, DW_AT_decl_line(0xbc)
    1987        .dwattr $C$DW$117, DW_AT_decl_column(0x0b)
    1988
    1989$C$DW$118       .dwtag  DW_TAG_member
    1990        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$142)
    1991        .dwattr $C$DW$118, DW_AT_name("$P$T9")
    1992        .dwattr $C$DW$118, DW_AT_TI_symbol_name("$P$T9")
    1993        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1994        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1995        .dwattr $C$DW$118, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1996        .dwattr $C$DW$118, DW_AT_decl_line(0xc0)
    1997        .dwattr $C$DW$118, DW_AT_decl_column(0x02)
    1998
    1999$C$DW$119       .dwtag  DW_TAG_member
    2000        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    2001        .dwattr $C$DW$119, DW_AT_name("rsvd2c")
    2002        .dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd2c")
    2003        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2004        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2005        .dwattr $C$DW$119, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2006        .dwattr $C$DW$119, DW_AT_decl_line(0xcb)
    2007        .dwattr $C$DW$119, DW_AT_decl_column(0x0b)
    2008
    2009$C$DW$120       .dwtag  DW_TAG_member
    2010        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$144)
    2011        .dwattr $C$DW$120, DW_AT_name("$P$T10")
    2012        .dwattr $C$DW$120, DW_AT_TI_symbol_name("$P$T10")
    2013        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2014        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2015        .dwattr $C$DW$120, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2016        .dwattr $C$DW$120, DW_AT_decl_line(0xcf)
    2017        .dwattr $C$DW$120, DW_AT_decl_column(0x02)
    2018
    2019$C$DW$121       .dwtag  DW_TAG_member
    2020        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$146)
    2021        .dwattr $C$DW$121, DW_AT_name("$P$T11")
    2022        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T11")
    2023        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2024        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2025        .dwattr $C$DW$121, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2026        .dwattr $C$DW$121, DW_AT_decl_line(0xda)
    2027        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    2028
    2029$C$DW$122       .dwtag  DW_TAG_member
    2030        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
    2031        .dwattr $C$DW$122, DW_AT_name("rsvd38")
    2032        .dwattr $C$DW$122, DW_AT_TI_symbol_name("rsvd38")
    2033        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2034        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2035        .dwattr $C$DW$122, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   38

    2036        .dwattr $C$DW$122, DW_AT_decl_line(0xe5)
    2037        .dwattr $C$DW$122, DW_AT_decl_column(0x0b)
    2038
    2039$C$DW$123       .dwtag  DW_TAG_member
    2040        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$148)
    2041        .dwattr $C$DW$123, DW_AT_name("$P$T12")
    2042        .dwattr $C$DW$123, DW_AT_TI_symbol_name("$P$T12")
    2043        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2044        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2045        .dwattr $C$DW$123, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2046        .dwattr $C$DW$123, DW_AT_decl_line(0xe8)
    2047        .dwattr $C$DW$123, DW_AT_decl_column(0x02)
    2048
    2049        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2050        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2051        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2052        .dwendtag $C$DW$T$35
    2053
    2054$C$DW$T$295     .dwtag  DW_TAG_typedef
    2055        .dwattr $C$DW$T$295, DW_AT_name("pruCfg")
    2056        .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$35)
    2057        .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
    2058        .dwattr $C$DW$T$295, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335
    2059        .dwattr $C$DW$T$295, DW_AT_decl_line(0xf0)
    2060        .dwattr $C$DW$T$295, DW_AT_decl_column(0x03)
    2061
    2062$C$DW$T$296     .dwtag  DW_TAG_volatile_type
    2063        .dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$295)
    2064
    2065
    2066$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2067        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2068$C$DW$124       .dwtag  DW_TAG_member
    2069        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    2070        .dwattr $C$DW$124, DW_AT_name("REV_MINOR")
    2071        .dwattr $C$DW$124, DW_AT_TI_symbol_name("REV_MINOR")
    2072        .dwattr $C$DW$124, DW_AT_bit_offset(0x1a)
    2073        .dwattr $C$DW$124, DW_AT_bit_size(0x06)
    2074        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2075        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2076        .dwattr $C$DW$124, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2077        .dwattr $C$DW$124, DW_AT_decl_line(0x2d)
    2078        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    2079
    2080$C$DW$125       .dwtag  DW_TAG_member
    2081        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    2082        .dwattr $C$DW$125, DW_AT_name("REV_CUSTOM")
    2083        .dwattr $C$DW$125, DW_AT_TI_symbol_name("REV_CUSTOM")
    2084        .dwattr $C$DW$125, DW_AT_bit_offset(0x18)
    2085        .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    2086        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2088        .dwattr $C$DW$125, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2089        .dwattr $C$DW$125, DW_AT_decl_line(0x2e)
    2090        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   39

    2091
    2092$C$DW$126       .dwtag  DW_TAG_member
    2093        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    2094        .dwattr $C$DW$126, DW_AT_name("REV_MAJOR")
    2095        .dwattr $C$DW$126, DW_AT_TI_symbol_name("REV_MAJOR")
    2096        .dwattr $C$DW$126, DW_AT_bit_offset(0x15)
    2097        .dwattr $C$DW$126, DW_AT_bit_size(0x03)
    2098        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2100        .dwattr $C$DW$126, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2101        .dwattr $C$DW$126, DW_AT_decl_line(0x2f)
    2102        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    2103
    2104$C$DW$127       .dwtag  DW_TAG_member
    2105        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    2106        .dwattr $C$DW$127, DW_AT_name("REV_RTL")
    2107        .dwattr $C$DW$127, DW_AT_TI_symbol_name("REV_RTL")
    2108        .dwattr $C$DW$127, DW_AT_bit_offset(0x10)
    2109        .dwattr $C$DW$127, DW_AT_bit_size(0x05)
    2110        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2112        .dwattr $C$DW$127, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2113        .dwattr $C$DW$127, DW_AT_decl_line(0x30)
    2114        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    2115
    2116$C$DW$128       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    2118        .dwattr $C$DW$128, DW_AT_name("REV_MODULE")
    2119        .dwattr $C$DW$128, DW_AT_TI_symbol_name("REV_MODULE")
    2120        .dwattr $C$DW$128, DW_AT_bit_offset(0x04)
    2121        .dwattr $C$DW$128, DW_AT_bit_size(0x0c)
    2122        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2124        .dwattr $C$DW$128, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2125        .dwattr $C$DW$128, DW_AT_decl_line(0x31)
    2126        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    2127
    2128$C$DW$129       .dwtag  DW_TAG_member
    2129        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    2130        .dwattr $C$DW$129, DW_AT_name("rsvd28")
    2131        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd28")
    2132        .dwattr $C$DW$129, DW_AT_bit_offset(0x02)
    2133        .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    2134        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2136        .dwattr $C$DW$129, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2137        .dwattr $C$DW$129, DW_AT_decl_line(0x32)
    2138        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    2139
    2140$C$DW$130       .dwtag  DW_TAG_member
    2141        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    2142        .dwattr $C$DW$130, DW_AT_name("REV_SCHEME")
    2143        .dwattr $C$DW$130, DW_AT_TI_symbol_name("REV_SCHEME")
    2144        .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2145        .dwattr $C$DW$130, DW_AT_bit_size(0x02)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   40

    2146        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2148        .dwattr $C$DW$130, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2149        .dwattr $C$DW$130, DW_AT_decl_line(0x33)
    2150        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    2151
    2152        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2153        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2154        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2155        .dwendtag $C$DW$T$36
    2156
    2157$C$DW$T$149     .dwtag  DW_TAG_volatile_type
    2158        .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$36)
    2159
    2160
    2161$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2162        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2163$C$DW$131       .dwtag  DW_TAG_member
    2164        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    2165        .dwattr $C$DW$131, DW_AT_name("rsvd0")
    2166        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd0")
    2167        .dwattr $C$DW$131, DW_AT_bit_offset(0x1e)
    2168        .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    2169        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2171        .dwattr $C$DW$131, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2172        .dwattr $C$DW$131, DW_AT_decl_line(0x3d)
    2173        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    2174
    2175$C$DW$132       .dwtag  DW_TAG_member
    2176        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    2177        .dwattr $C$DW$132, DW_AT_name("NEST_MODE")
    2178        .dwattr $C$DW$132, DW_AT_TI_symbol_name("NEST_MODE")
    2179        .dwattr $C$DW$132, DW_AT_bit_offset(0x1c)
    2180        .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    2181        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2183        .dwattr $C$DW$132, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2184        .dwattr $C$DW$132, DW_AT_decl_line(0x3e)
    2185        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    2186
    2187$C$DW$133       .dwtag  DW_TAG_member
    2188        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    2189        .dwattr $C$DW$133, DW_AT_name("rsvd4")
    2190        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd4")
    2191        .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    2192        .dwattr $C$DW$133, DW_AT_bit_size(0x1c)
    2193        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2195        .dwattr $C$DW$133, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2196        .dwattr $C$DW$133, DW_AT_decl_line(0x3f)
    2197        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    2198
    2199        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2200        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   41

    2201        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2202        .dwendtag $C$DW$T$37
    2203
    2204$C$DW$T$151     .dwtag  DW_TAG_volatile_type
    2205        .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$37)
    2206
    2207
    2208$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2209        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2210$C$DW$134       .dwtag  DW_TAG_member
    2211        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    2212        .dwattr $C$DW$134, DW_AT_name("EN_HINT_ANY")
    2213        .dwattr $C$DW$134, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2214        .dwattr $C$DW$134, DW_AT_bit_offset(0x1f)
    2215        .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2216        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2217        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2218        .dwattr $C$DW$134, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2219        .dwattr $C$DW$134, DW_AT_decl_line(0x4c)
    2220        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    2221
    2222$C$DW$135       .dwtag  DW_TAG_member
    2223        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    2224        .dwattr $C$DW$135, DW_AT_name("rsvd1")
    2225        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd1")
    2226        .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2227        .dwattr $C$DW$135, DW_AT_bit_size(0x1f)
    2228        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2230        .dwattr $C$DW$135, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2231        .dwattr $C$DW$135, DW_AT_decl_line(0x4d)
    2232        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    2233
    2234        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2235        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2236        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2237        .dwendtag $C$DW$T$38
    2238
    2239$C$DW$T$153     .dwtag  DW_TAG_volatile_type
    2240        .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$38)
    2241
    2242
    2243$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2244        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2245$C$DW$136       .dwtag  DW_TAG_member
    2246        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    2247        .dwattr $C$DW$136, DW_AT_name("GLB_NEST_LEVEL")
    2248        .dwattr $C$DW$136, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2249        .dwattr $C$DW$136, DW_AT_bit_offset(0x17)
    2250        .dwattr $C$DW$136, DW_AT_bit_size(0x09)
    2251        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2253        .dwattr $C$DW$136, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2254        .dwattr $C$DW$136, DW_AT_decl_line(0x5a)
    2255        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:06 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru1_mcp3208_comm.asm                                            PAGE   42

    2256
    2257$C$DW$137       .dwtag  DW_TAG_member
    2258        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    2259        .dwattr $C$DW$137, DW_AT_name("rsvd9")
    2260        .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd9")
    2261        .dwattr $C$DW$137, DW_AT_bit_offset(0x01)
    2262        .dwattr $C$DW$137, DW_AT_bit_size(0x16)
    2263        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2265        .dwattr $C$DW$137, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2266        .dwattr $C$DW$137, DW_AT_decl_line(0x5b)
    2267        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    2268
    2269$C$DW$138       .dwtag  DW_TAG_member
    2270        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    2271        .dwattr $C$DW$138, DW_AT_name("AUTO_OVERRIDE")
    2272        .dwattr $C$DW$138, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2273        .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2274        .dwattr $C$DW$138, DW_AT_bit_size(0x01)
