PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.3 *
       3;* Date/Time created: Wed Aug 12 00:15:07 2020                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru_timer.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.3 Copyright (c) 2012-2018 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/pru-mcp3208-6ch/pru1_mcp3208_comm")
      12 00000000                         .data
      13        .align  1
      14        .elfsym ||pru1_extended_cycles||,SYM_SIZE(8)
      15 00000000                 ||pru1_extended_cycles||:
      16 00000000 00000000000000          .bits           0,64
         00000004 00000000000000 
      17                        ; pru1_extended_cycles @ 0
      18
      19$C$DW$1 .dwtag  DW_TAG_variable

     173;* FUNCTION PROPERTIES                                         *
     174;*                            0 Auto,  2 SOE     *
     175;***************************************************************
     176
     177||clock_ns||:
     178;* --------------------------------------------------------------------------*
     179;* r14_0 assigned to total_cycles
     180$C$DW$7 .dwtag  DW_TAG_variable
     181        .dwattr $C$DW$7, DW_AT_name("total_cycles")
     182        .dwattr $C$DW$7, DW_AT_TI_symbol_name("total_cycles")
     183        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$60)
     184        .dwattr $C$DW$7, DW_AT_location[DW_OP_regx 0x38]
     185
     186        .dwcfi  cfa_offset, 0
     187;*** 28 -----------------------    manage_pru1_cycle_overflow();
     188;*** 29 -----------------------    total_cycles = (unsigned long long)(*(volatile struct $$fake9 *)0x2
     189;*** 30 -----------------------    return total_cycles*5uLL;
     190 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     191        .dwcfi  cfa_offset, 2
     192 00000004 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     193        .dwcfi  save_reg_to_mem, 14, -2
     194        .dwcfi  save_reg_to_mem, 15, -1
     195        .dwpsn  file "pru_timer.c",line 28,column 3,is_stmt,isa 0
     196;----------------------------------------------------------------------
     197;  28 | manage_pru1_cycle_overflow();                                          
     198;----------------------------------------------------------------------
     199$C$DW$8 .dwtag  DW_TAG_TI_branch
     200        .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     201        .dwattr $C$DW$8, DW_AT_name("manage_pru1_cycle_overflow")
     202        .dwattr $C$DW$8, DW_AT_TI_call
     203
     204 00000008 000000230000C3!         JAL       r3.w2, ||manage_pru1_cycle_overflow|| ; [ALU_PRU] |28| manage_pru1_cycle_overflow
     205        .dwpsn  file "pru_timer.c",line 29,column 25,is_stmt,isa 0
     206;----------------------------------------------------------------------
     207;  29 | uint64_t total_cycles = PRU1_CTRL.CYCLE + pru1_extended_cycles;        
     208;----------------------------------------------------------------------
     209 0000000c 0000002EFF8191          ZERO      &r17, 4               ; [ALU_PRU] |29| 
     210 00000010 400C80240002C0          LDI32     r0, 0x0002400c        ; [ALU_PRU] |29| 
     211 00000018 000000240000E1!         LDI       r1, ||pru1_extended_cycles|| ; [ALU_PRU] |29| pru1_extended_cycles
     212        .dwpsn  file "pru_timer.c",line 30,column 3,is_stmt,isa 0
     213;----------------------------------------------------------------------
     214;  30 | return total_cycles * 5;                                               
     215;----------------------------------------------------------------------
     216 0000001c 000000240005F0          LDI       r16, 0x0005           ; [ALU_PRU] |30| 
     217        .dwpsn  file "pru_timer.c",line 29,column 25,is_stmt,isa 0
     218 00000020 000000F1002080          LBBO      &r0, r0, 0, 4         ; [ALU_PRU] |29| 
     219 00000024 000000F100618E          LBBO      &r14, r1, 0, 8        ; [ALU_PRU] |29| 
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    5

     220 00000028 00000000E0EEEE          ADD       r14, r14, r0          ; [ALU_PRU] |29| total_cycles
     221 0000002c 00000002F1EFEF          ADC       r15, r15, r17         ; [ALU_PRU] |29| 
     222        .dwpsn  file "pru_timer.c",line 30,column 3,is_stmt,isa 0
     223$C$DW$9 .dwtag  DW_TAG_TI_branch
     224        .dwattr $C$DW$9, DW_AT_low_pc(0x00)
     225        .dwattr $C$DW$9, DW_AT_name("__pruabi_mpyll")
     226        .dwattr $C$DW$9, DW_AT_TI_call
     227
     228 00000030 000000230000C3!         JAL       r3.w2, ||__pruabi_mpyll|| ; [ALU_PRU] |30| __pruabi_mpyll
     229 00000034 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     230        .dwcfi  restore_reg, 14
     231        .dwcfi  restore_reg, 15
     232 00000038 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     233        .dwcfi  cfa_offset, 0
     234$C$DW$10        .dwtag  DW_TAG_TI_branch
     235        .dwattr $C$DW$10, DW_AT_low_pc(0x00)
     236        .dwattr $C$DW$10, DW_AT_TI_return
     237
     238 0000003c 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     239        .dwattr $C$DW$6, DW_AT_TI_end_file("pru_timer.c")
     240        .dwattr $C$DW$6, DW_AT_TI_end_line(0x1f)
     241        .dwattr $C$DW$6, DW_AT_TI_end_column(0x01)
     242        .dwendentry
     243        .dwendtag $C$DW$6
     244
     245;* Inlined function references:
     246;* [0] start_pru1_timer
     247;* [1] stop_pru1_timer
     248;*****************************************************************************
     249;* UNDEFINED EXTERNAL REFERENCES                                             *
     250;*****************************************************************************
     251        .global ||__pruabi_mpyll||
     252
     253;******************************************************************************
     254;* TYPE INFORMATION                                                           *
     255;******************************************************************************
     256
     257$C$DW$T$19      .dwtag  DW_TAG_structure_type
     258        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     259$C$DW$11        .dwtag  DW_TAG_member
     260        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     261        .dwattr $C$DW$11, DW_AT_name("SOFT_RST_N")
     262        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SOFT_RST_N")
     263        .dwattr $C$DW$11, DW_AT_bit_offset(0x1f)
     264        .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     265        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     267        .dwattr $C$DW$11, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     268        .dwattr $C$DW$11, DW_AT_decl_line(0x2d)
     269        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     270
     271$C$DW$12        .dwtag  DW_TAG_member
     272        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     273        .dwattr $C$DW$12, DW_AT_name("EN")
     274        .dwattr $C$DW$12, DW_AT_TI_symbol_name("EN")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    6

     275        .dwattr $C$DW$12, DW_AT_bit_offset(0x1e)
     276        .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     277        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     279        .dwattr $C$DW$12, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     280        .dwattr $C$DW$12, DW_AT_decl_line(0x2e)
     281        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     282
     283$C$DW$13        .dwtag  DW_TAG_member
     284        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     285        .dwattr $C$DW$13, DW_AT_name("SLEEPING")
     286        .dwattr $C$DW$13, DW_AT_TI_symbol_name("SLEEPING")
     287        .dwattr $C$DW$13, DW_AT_bit_offset(0x1d)
     288        .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     289        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     290        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     291        .dwattr $C$DW$13, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     292        .dwattr $C$DW$13, DW_AT_decl_line(0x2f)
     293        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     294
     295$C$DW$14        .dwtag  DW_TAG_member
     296        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     297        .dwattr $C$DW$14, DW_AT_name("CTR_EN")
     298        .dwattr $C$DW$14, DW_AT_TI_symbol_name("CTR_EN")
     299        .dwattr $C$DW$14, DW_AT_bit_offset(0x1c)
     300        .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     301        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     303        .dwattr $C$DW$14, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     304        .dwattr $C$DW$14, DW_AT_decl_line(0x30)
     305        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     306
     307$C$DW$15        .dwtag  DW_TAG_member
     308        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     309        .dwattr $C$DW$15, DW_AT_name("rsvd4")
     310        .dwattr $C$DW$15, DW_AT_TI_symbol_name("rsvd4")
     311        .dwattr $C$DW$15, DW_AT_bit_offset(0x18)
     312        .dwattr $C$DW$15, DW_AT_bit_size(0x04)
     313        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     314        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     315        .dwattr $C$DW$15, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     316        .dwattr $C$DW$15, DW_AT_decl_line(0x31)
     317        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     318
     319$C$DW$16        .dwtag  DW_TAG_member
     320        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     321        .dwattr $C$DW$16, DW_AT_name("SINGLE_STEP")
     322        .dwattr $C$DW$16, DW_AT_TI_symbol_name("SINGLE_STEP")
     323        .dwattr $C$DW$16, DW_AT_bit_offset(0x17)
     324        .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     325        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     326        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     327        .dwattr $C$DW$16, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     328        .dwattr $C$DW$16, DW_AT_decl_line(0x32)
     329        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    7

     330
     331$C$DW$17        .dwtag  DW_TAG_member
     332        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     333        .dwattr $C$DW$17, DW_AT_name("rsvd9")
     334        .dwattr $C$DW$17, DW_AT_TI_symbol_name("rsvd9")
     335        .dwattr $C$DW$17, DW_AT_bit_offset(0x11)
     336        .dwattr $C$DW$17, DW_AT_bit_size(0x06)
     337        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     338        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     339        .dwattr $C$DW$17, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     340        .dwattr $C$DW$17, DW_AT_decl_line(0x33)
     341        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     342
     343$C$DW$18        .dwtag  DW_TAG_member
     344        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     345        .dwattr $C$DW$18, DW_AT_name("RUNSTATE")
     346        .dwattr $C$DW$18, DW_AT_TI_symbol_name("RUNSTATE")
     347        .dwattr $C$DW$18, DW_AT_bit_offset(0x10)
     348        .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     349        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     350        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     351        .dwattr $C$DW$18, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     352        .dwattr $C$DW$18, DW_AT_decl_line(0x34)
     353        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     354
     355$C$DW$19        .dwtag  DW_TAG_member
     356        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     357        .dwattr $C$DW$19, DW_AT_name("PCTR_RST_VAL")
     358        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PCTR_RST_VAL")
     359        .dwattr $C$DW$19, DW_AT_bit_offset(0x00)
     360        .dwattr $C$DW$19, DW_AT_bit_size(0x10)
     361        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     363        .dwattr $C$DW$19, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     364        .dwattr $C$DW$19, DW_AT_decl_line(0x35)
     365        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     366
     367        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     368        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     369        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     370        .dwendtag $C$DW$T$19
     371
     372$C$DW$T$32      .dwtag  DW_TAG_volatile_type
     373        .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
     374
     375$C$DW$T$50      .dwtag  DW_TAG_pointer_type
     376        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$32)
     377        .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
     378
     379
     380$C$DW$T$20      .dwtag  DW_TAG_structure_type
     381        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     382$C$DW$20        .dwtag  DW_TAG_member
     383        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     384        .dwattr $C$DW$20, DW_AT_name("PCTR")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    8

     385        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PCTR")
     386        .dwattr $C$DW$20, DW_AT_bit_offset(0x10)
     387        .dwattr $C$DW$20, DW_AT_bit_size(0x10)
     388        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     390        .dwattr $C$DW$20, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     391        .dwattr $C$DW$20, DW_AT_decl_line(0x3f)
     392        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     393
     394$C$DW$21        .dwtag  DW_TAG_member
     395        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     396        .dwattr $C$DW$21, DW_AT_name("rsvd16")
     397        .dwattr $C$DW$21, DW_AT_TI_symbol_name("rsvd16")
     398        .dwattr $C$DW$21, DW_AT_bit_offset(0x00)
     399        .dwattr $C$DW$21, DW_AT_bit_size(0x10)
     400        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     401        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     402        .dwattr $C$DW$21, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     403        .dwattr $C$DW$21, DW_AT_decl_line(0x40)
     404        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     405
     406        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     407        .dwattr $C$DW$T$20, DW_AT_decl_line(0x3e)
     408        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     409        .dwendtag $C$DW$T$20
     410
     411$C$DW$T$34      .dwtag  DW_TAG_volatile_type
     412        .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
     413
     414
     415$C$DW$T$21      .dwtag  DW_TAG_structure_type
     416        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     417$C$DW$22        .dwtag  DW_TAG_member
     418        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     419        .dwattr $C$DW$22, DW_AT_name("BITWISE_ENS")
     420        .dwattr $C$DW$22, DW_AT_TI_symbol_name("BITWISE_ENS")
     421        .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     422        .dwattr $C$DW$22, DW_AT_bit_size(0x20)
     423        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     425        .dwattr $C$DW$22, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     426        .dwattr $C$DW$22, DW_AT_decl_line(0x4a)
     427        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     428
     429        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     430        .dwattr $C$DW$T$21, DW_AT_decl_line(0x49)
     431        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     432        .dwendtag $C$DW$T$21
     433
     434$C$DW$T$36      .dwtag  DW_TAG_volatile_type
     435        .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$21)
     436
     437
     438$C$DW$T$22      .dwtag  DW_TAG_structure_type
     439        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE    9

     440$C$DW$23        .dwtag  DW_TAG_member
     441        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     442        .dwattr $C$DW$23, DW_AT_name("CYCLECOUNT")
     443        .dwattr $C$DW$23, DW_AT_TI_symbol_name("CYCLECOUNT")
     444        .dwattr $C$DW$23, DW_AT_bit_offset(0x00)
     445        .dwattr $C$DW$23, DW_AT_bit_size(0x20)
     446        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     448        .dwattr $C$DW$23, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     449        .dwattr $C$DW$23, DW_AT_decl_line(0x54)
     450        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     451
     452        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     453        .dwattr $C$DW$T$22, DW_AT_decl_line(0x53)
     454        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     455        .dwendtag $C$DW$T$22
     456
     457$C$DW$T$38      .dwtag  DW_TAG_volatile_type
     458        .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
     459
     460
     461$C$DW$T$23      .dwtag  DW_TAG_structure_type
     462        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     463$C$DW$24        .dwtag  DW_TAG_member
     464        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     465        .dwattr $C$DW$24, DW_AT_name("STALLCOUNT")
     466        .dwattr $C$DW$24, DW_AT_TI_symbol_name("STALLCOUNT")
     467        .dwattr $C$DW$24, DW_AT_bit_offset(0x00)
     468        .dwattr $C$DW$24, DW_AT_bit_size(0x20)
     469        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     471        .dwattr $C$DW$24, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     472        .dwattr $C$DW$24, DW_AT_decl_line(0x5e)
     473        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     474
     475        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     476        .dwattr $C$DW$T$23, DW_AT_decl_line(0x5d)
     477        .dwattr $C$DW$T$23, DW_AT_decl_column(0x14)
     478        .dwendtag $C$DW$T$23
     479
     480$C$DW$T$40      .dwtag  DW_TAG_volatile_type
     481        .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$23)
     482
     483
     484$C$DW$T$24      .dwtag  DW_TAG_structure_type
     485        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     486$C$DW$25        .dwtag  DW_TAG_member
     487        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     488        .dwattr $C$DW$25, DW_AT_name("C24_BLK_IDX")
     489        .dwattr $C$DW$25, DW_AT_TI_symbol_name("C24_BLK_IDX")
     490        .dwattr $C$DW$25, DW_AT_bit_offset(0x18)
     491        .dwattr $C$DW$25, DW_AT_bit_size(0x08)
     492        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     494        .dwattr $C$DW$25, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   10

     495        .dwattr $C$DW$25, DW_AT_decl_line(0x6b)
     496        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     497
     498$C$DW$26        .dwtag  DW_TAG_member
     499        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     500        .dwattr $C$DW$26, DW_AT_name("rsvd8")
     501        .dwattr $C$DW$26, DW_AT_TI_symbol_name("rsvd8")
     502        .dwattr $C$DW$26, DW_AT_bit_offset(0x10)
     503        .dwattr $C$DW$26, DW_AT_bit_size(0x08)
     504        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     506        .dwattr $C$DW$26, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     507        .dwattr $C$DW$26, DW_AT_decl_line(0x6c)
     508        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     509
     510$C$DW$27        .dwtag  DW_TAG_member
     511        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     512        .dwattr $C$DW$27, DW_AT_name("C25_BLK_IDX")
     513        .dwattr $C$DW$27, DW_AT_TI_symbol_name("C25_BLK_IDX")
     514        .dwattr $C$DW$27, DW_AT_bit_offset(0x08)
     515        .dwattr $C$DW$27, DW_AT_bit_size(0x08)
     516        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     518        .dwattr $C$DW$27, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     519        .dwattr $C$DW$27, DW_AT_decl_line(0x6d)
     520        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     521
     522$C$DW$28        .dwtag  DW_TAG_member
     523        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     524        .dwattr $C$DW$28, DW_AT_name("rsvd24")
     525        .dwattr $C$DW$28, DW_AT_TI_symbol_name("rsvd24")
     526        .dwattr $C$DW$28, DW_AT_bit_offset(0x00)
     527        .dwattr $C$DW$28, DW_AT_bit_size(0x08)
     528        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     530        .dwattr $C$DW$28, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     531        .dwattr $C$DW$28, DW_AT_decl_line(0x6e)
     532        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     533
     534        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     535        .dwattr $C$DW$T$24, DW_AT_decl_line(0x6a)
     536        .dwattr $C$DW$T$24, DW_AT_decl_column(0x13)
     537        .dwendtag $C$DW$T$24
     538
     539$C$DW$T$42      .dwtag  DW_TAG_volatile_type
     540        .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
     541
     542
     543$C$DW$T$25      .dwtag  DW_TAG_structure_type
     544        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     545$C$DW$29        .dwtag  DW_TAG_member
     546        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     547        .dwattr $C$DW$29, DW_AT_name("C26_BLK_IDX")
     548        .dwattr $C$DW$29, DW_AT_TI_symbol_name("C26_BLK_IDX")
     549        .dwattr $C$DW$29, DW_AT_bit_offset(0x18)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   11

     550        .dwattr $C$DW$29, DW_AT_bit_size(0x08)
     551        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     553        .dwattr $C$DW$29, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     554        .dwattr $C$DW$29, DW_AT_decl_line(0x78)
     555        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     556
     557$C$DW$30        .dwtag  DW_TAG_member
     558        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     559        .dwattr $C$DW$30, DW_AT_name("rsvd8")
     560        .dwattr $C$DW$30, DW_AT_TI_symbol_name("rsvd8")
     561        .dwattr $C$DW$30, DW_AT_bit_offset(0x10)
     562        .dwattr $C$DW$30, DW_AT_bit_size(0x08)
     563        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     565        .dwattr $C$DW$30, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     566        .dwattr $C$DW$30, DW_AT_decl_line(0x79)
     567        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     568
     569$C$DW$31        .dwtag  DW_TAG_member
     570        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     571        .dwattr $C$DW$31, DW_AT_name("C27_BLK_IDX")
     572        .dwattr $C$DW$31, DW_AT_TI_symbol_name("C27_BLK_IDX")
     573        .dwattr $C$DW$31, DW_AT_bit_offset(0x08)
     574        .dwattr $C$DW$31, DW_AT_bit_size(0x08)
     575        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     577        .dwattr $C$DW$31, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     578        .dwattr $C$DW$31, DW_AT_decl_line(0x7a)
     579        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     580
     581$C$DW$32        .dwtag  DW_TAG_member
     582        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     583        .dwattr $C$DW$32, DW_AT_name("rsvd24")
     584        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd24")
     585        .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     586        .dwattr $C$DW$32, DW_AT_bit_size(0x08)
     587        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     589        .dwattr $C$DW$32, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     590        .dwattr $C$DW$32, DW_AT_decl_line(0x7b)
     591        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     592
     593        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     594        .dwattr $C$DW$T$25, DW_AT_decl_line(0x77)
     595        .dwattr $C$DW$T$25, DW_AT_decl_column(0x13)
     596        .dwendtag $C$DW$T$25
     597
     598$C$DW$T$44      .dwtag  DW_TAG_volatile_type
     599        .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$25)
     600
     601
     602$C$DW$T$26      .dwtag  DW_TAG_structure_type
     603        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     604$C$DW$33        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   12

     605        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     606        .dwattr $C$DW$33, DW_AT_name("C28_BLK_POINTER")
     607        .dwattr $C$DW$33, DW_AT_TI_symbol_name("C28_BLK_POINTER")
     608        .dwattr $C$DW$33, DW_AT_bit_offset(0x10)
     609        .dwattr $C$DW$33, DW_AT_bit_size(0x10)
     610        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     612        .dwattr $C$DW$33, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     613        .dwattr $C$DW$33, DW_AT_decl_line(0x85)
     614        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     615
     616$C$DW$34        .dwtag  DW_TAG_member
     617        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     618        .dwattr $C$DW$34, DW_AT_name("C29_BLK_POINTER")
     619        .dwattr $C$DW$34, DW_AT_TI_symbol_name("C29_BLK_POINTER")
     620        .dwattr $C$DW$34, DW_AT_bit_offset(0x00)
     621        .dwattr $C$DW$34, DW_AT_bit_size(0x10)
     622        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     624        .dwattr $C$DW$34, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     625        .dwattr $C$DW$34, DW_AT_decl_line(0x86)
     626        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     627
     628        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     629        .dwattr $C$DW$T$26, DW_AT_decl_line(0x84)
     630        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     631        .dwendtag $C$DW$T$26
     632
     633$C$DW$T$46      .dwtag  DW_TAG_volatile_type
     634        .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$26)
     635
     636
     637$C$DW$T$27      .dwtag  DW_TAG_structure_type
     638        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     639$C$DW$35        .dwtag  DW_TAG_member
     640        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     641        .dwattr $C$DW$35, DW_AT_name("C30_BLK_POINTER")
     642        .dwattr $C$DW$35, DW_AT_TI_symbol_name("C30_BLK_POINTER")
     643        .dwattr $C$DW$35, DW_AT_bit_offset(0x10)
     644        .dwattr $C$DW$35, DW_AT_bit_size(0x10)
     645        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     647        .dwattr $C$DW$35, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     648        .dwattr $C$DW$35, DW_AT_decl_line(0x90)
     649        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     650
     651$C$DW$36        .dwtag  DW_TAG_member
     652        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     653        .dwattr $C$DW$36, DW_AT_name("C31_BLK_POINTER")
     654        .dwattr $C$DW$36, DW_AT_TI_symbol_name("C31_BLK_POINTER")
     655        .dwattr $C$DW$36, DW_AT_bit_offset(0x00)
     656        .dwattr $C$DW$36, DW_AT_bit_size(0x10)
     657        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     659        .dwattr $C$DW$36, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   13

     660        .dwattr $C$DW$36, DW_AT_decl_line(0x91)
     661        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     662
     663        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     664        .dwattr $C$DW$T$27, DW_AT_decl_line(0x8f)
     665        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     666        .dwendtag $C$DW$T$27
     667
     668$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     669        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$27)
     670
     671
     672$C$DW$T$30      .dwtag  DW_TAG_structure_type
     673        .dwattr $C$DW$T$30, DW_AT_byte_size(0x30)
     674$C$DW$37        .dwtag  DW_TAG_member
     675        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$33)
     676        .dwattr $C$DW$37, DW_AT_name("$P$T0")
     677        .dwattr $C$DW$37, DW_AT_TI_symbol_name("$P$T0")
     678        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     680        .dwattr $C$DW$37, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     681        .dwattr $C$DW$37, DW_AT_decl_line(0x29)
     682        .dwattr $C$DW$37, DW_AT_decl_column(0x02)
     683
     684$C$DW$38        .dwtag  DW_TAG_member
     685        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$35)
     686        .dwattr $C$DW$38, DW_AT_name("$P$T1")
     687        .dwattr $C$DW$38, DW_AT_TI_symbol_name("$P$T1")
     688        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     689        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     690        .dwattr $C$DW$38, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     691        .dwattr $C$DW$38, DW_AT_decl_line(0x3b)
     692        .dwattr $C$DW$38, DW_AT_decl_column(0x02)
     693
     694$C$DW$39        .dwtag  DW_TAG_member
     695        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$37)
     696        .dwattr $C$DW$39, DW_AT_name("$P$T2")
     697        .dwattr $C$DW$39, DW_AT_TI_symbol_name("$P$T2")
     698        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     699        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     700        .dwattr $C$DW$39, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     701        .dwattr $C$DW$39, DW_AT_decl_line(0x46)
     702        .dwattr $C$DW$39, DW_AT_decl_column(0x02)
     703
     704$C$DW$40        .dwtag  DW_TAG_member
     705        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$39)
     706        .dwattr $C$DW$40, DW_AT_name("$P$T3")
     707        .dwattr $C$DW$40, DW_AT_TI_symbol_name("$P$T3")
     708        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     709        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     710        .dwattr $C$DW$40, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     711        .dwattr $C$DW$40, DW_AT_decl_line(0x50)
     712        .dwattr $C$DW$40, DW_AT_decl_column(0x02)
     713
     714$C$DW$41        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   14

     715        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$41)
     716        .dwattr $C$DW$41, DW_AT_name("$P$T4")
     717        .dwattr $C$DW$41, DW_AT_TI_symbol_name("$P$T4")
     718        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     719        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     720        .dwattr $C$DW$41, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     721        .dwattr $C$DW$41, DW_AT_decl_line(0x5a)
     722        .dwattr $C$DW$41, DW_AT_decl_column(0x02)
     723
     724$C$DW$42        .dwtag  DW_TAG_member
     725        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$29)
     726        .dwattr $C$DW$42, DW_AT_name("rsvd14")
     727        .dwattr $C$DW$42, DW_AT_TI_symbol_name("rsvd14")
     728        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     729        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     730        .dwattr $C$DW$42, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     731        .dwattr $C$DW$42, DW_AT_decl_line(0x63)
     732        .dwattr $C$DW$42, DW_AT_decl_column(0x0b)
     733
     734$C$DW$43        .dwtag  DW_TAG_member
     735        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$43)
     736        .dwattr $C$DW$43, DW_AT_name("$P$T5")
     737        .dwattr $C$DW$43, DW_AT_TI_symbol_name("$P$T5")
     738        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     739        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     740        .dwattr $C$DW$43, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     741        .dwattr $C$DW$43, DW_AT_decl_line(0x67)
     742        .dwattr $C$DW$43, DW_AT_decl_column(0x02)
     743
     744$C$DW$44        .dwtag  DW_TAG_member
     745        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$45)
     746        .dwattr $C$DW$44, DW_AT_name("$P$T6")
     747        .dwattr $C$DW$44, DW_AT_TI_symbol_name("$P$T6")
     748        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     749        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     750        .dwattr $C$DW$44, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     751        .dwattr $C$DW$44, DW_AT_decl_line(0x74)
     752        .dwattr $C$DW$44, DW_AT_decl_column(0x02)
     753
     754$C$DW$45        .dwtag  DW_TAG_member
     755        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$47)
     756        .dwattr $C$DW$45, DW_AT_name("$P$T7")
     757        .dwattr $C$DW$45, DW_AT_TI_symbol_name("$P$T7")
     758        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     759        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     760        .dwattr $C$DW$45, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     761        .dwattr $C$DW$45, DW_AT_decl_line(0x81)
     762        .dwattr $C$DW$45, DW_AT_decl_column(0x02)
     763
     764$C$DW$46        .dwtag  DW_TAG_member
     765        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$49)
     766        .dwattr $C$DW$46, DW_AT_name("$P$T8")
     767        .dwattr $C$DW$46, DW_AT_TI_symbol_name("$P$T8")
     768        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     769        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   15

     770        .dwattr $C$DW$46, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     771        .dwattr $C$DW$46, DW_AT_decl_line(0x8c)
     772        .dwattr $C$DW$46, DW_AT_decl_column(0x02)
     773
     774        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     775        .dwattr $C$DW$T$30, DW_AT_decl_line(0x26)
     776        .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     777        .dwendtag $C$DW$T$30
     778
     779$C$DW$T$53      .dwtag  DW_TAG_typedef
     780        .dwattr $C$DW$T$53, DW_AT_name("pruCtrl")
     781        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$30)
     782        .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     783        .dwattr $C$DW$T$53, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     784        .dwattr $C$DW$T$53, DW_AT_decl_line(0x95)
     785        .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
     786
     787
     788$C$DW$T$33      .dwtag  DW_TAG_union_type
     789        .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
     790$C$DW$47        .dwtag  DW_TAG_member
     791        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$31)
     792        .dwattr $C$DW$47, DW_AT_name("CTRL")
     793        .dwattr $C$DW$47, DW_AT_TI_symbol_name("CTRL")
     794        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     796        .dwattr $C$DW$47, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     797        .dwattr $C$DW$47, DW_AT_decl_line(0x2a)
     798        .dwattr $C$DW$47, DW_AT_decl_column(0x15)
     799
     800$C$DW$48        .dwtag  DW_TAG_member
     801        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$32)
     802        .dwattr $C$DW$48, DW_AT_name("CTRL_bit")
     803        .dwattr $C$DW$48, DW_AT_TI_symbol_name("CTRL_bit")
     804        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     806        .dwattr $C$DW$48, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     807        .dwattr $C$DW$48, DW_AT_decl_line(0x36)
     808        .dwattr $C$DW$48, DW_AT_decl_column(0x05)
     809
     810        .dwattr $C$DW$T$33, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     811        .dwattr $C$DW$T$33, DW_AT_decl_line(0x29)
     812        .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
     813        .dwendtag $C$DW$T$33
     814
     815
     816$C$DW$T$35      .dwtag  DW_TAG_union_type
     817        .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     818$C$DW$49        .dwtag  DW_TAG_member
     819        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$31)
     820        .dwattr $C$DW$49, DW_AT_name("STS")
     821        .dwattr $C$DW$49, DW_AT_TI_symbol_name("STS")
     822        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     824        .dwattr $C$DW$49, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   16

     825        .dwattr $C$DW$49, DW_AT_decl_line(0x3c)
     826        .dwattr $C$DW$49, DW_AT_decl_column(0x15)
     827
     828$C$DW$50        .dwtag  DW_TAG_member
     829        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$34)
     830        .dwattr $C$DW$50, DW_AT_name("STS_bit")
     831        .dwattr $C$DW$50, DW_AT_TI_symbol_name("STS_bit")
     832        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     834        .dwattr $C$DW$50, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     835        .dwattr $C$DW$50, DW_AT_decl_line(0x41)
     836        .dwattr $C$DW$50, DW_AT_decl_column(0x05)
     837
     838        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     839        .dwattr $C$DW$T$35, DW_AT_decl_line(0x3b)
     840        .dwattr $C$DW$T$35, DW_AT_decl_column(0x08)
     841        .dwendtag $C$DW$T$35
     842
     843
     844$C$DW$T$37      .dwtag  DW_TAG_union_type
     845        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
     846$C$DW$51        .dwtag  DW_TAG_member
     847        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     848        .dwattr $C$DW$51, DW_AT_name("WAKEUP_EN")
     849        .dwattr $C$DW$51, DW_AT_TI_symbol_name("WAKEUP_EN")
     850        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     852        .dwattr $C$DW$51, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     853        .dwattr $C$DW$51, DW_AT_decl_line(0x47)
     854        .dwattr $C$DW$51, DW_AT_decl_column(0x15)
     855
     856$C$DW$52        .dwtag  DW_TAG_member
     857        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$36)
     858        .dwattr $C$DW$52, DW_AT_name("WAKEUP_EN_bit")
     859        .dwattr $C$DW$52, DW_AT_TI_symbol_name("WAKEUP_EN_bit")
     860        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     862        .dwattr $C$DW$52, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     863        .dwattr $C$DW$52, DW_AT_decl_line(0x4b)
     864        .dwattr $C$DW$52, DW_AT_decl_column(0x05)
     865
     866        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     867        .dwattr $C$DW$T$37, DW_AT_decl_line(0x46)
     868        .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
     869        .dwendtag $C$DW$T$37
     870
     871
     872$C$DW$T$39      .dwtag  DW_TAG_union_type
     873        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
     874$C$DW$53        .dwtag  DW_TAG_member
     875        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$31)
     876        .dwattr $C$DW$53, DW_AT_name("CYCLE")
     877        .dwattr $C$DW$53, DW_AT_TI_symbol_name("CYCLE")
     878        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   17

     880        .dwattr $C$DW$53, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     881        .dwattr $C$DW$53, DW_AT_decl_line(0x51)
     882        .dwattr $C$DW$53, DW_AT_decl_column(0x15)
     883
     884$C$DW$54        .dwtag  DW_TAG_member
     885        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$38)
     886        .dwattr $C$DW$54, DW_AT_name("CYCLE_bit")
     887        .dwattr $C$DW$54, DW_AT_TI_symbol_name("CYCLE_bit")
     888        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     890        .dwattr $C$DW$54, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     891        .dwattr $C$DW$54, DW_AT_decl_line(0x55)
     892        .dwattr $C$DW$54, DW_AT_decl_column(0x05)
     893
     894        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     895        .dwattr $C$DW$T$39, DW_AT_decl_line(0x50)
     896        .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
     897        .dwendtag $C$DW$T$39
     898
     899
     900$C$DW$T$41      .dwtag  DW_TAG_union_type
     901        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
     902$C$DW$55        .dwtag  DW_TAG_member
     903        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$31)
     904        .dwattr $C$DW$55, DW_AT_name("STALL")
     905        .dwattr $C$DW$55, DW_AT_TI_symbol_name("STALL")
     906        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     908        .dwattr $C$DW$55, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     909        .dwattr $C$DW$55, DW_AT_decl_line(0x5b)
     910        .dwattr $C$DW$55, DW_AT_decl_column(0x15)
     911
     912$C$DW$56        .dwtag  DW_TAG_member
     913        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$40)
     914        .dwattr $C$DW$56, DW_AT_name("STALL_bit")
     915        .dwattr $C$DW$56, DW_AT_TI_symbol_name("STALL_bit")
     916        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     918        .dwattr $C$DW$56, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     919        .dwattr $C$DW$56, DW_AT_decl_line(0x5f)
     920        .dwattr $C$DW$56, DW_AT_decl_column(0x05)
     921
     922        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     923        .dwattr $C$DW$T$41, DW_AT_decl_line(0x5a)
     924        .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
     925        .dwendtag $C$DW$T$41
     926
     927
     928$C$DW$T$43      .dwtag  DW_TAG_union_type
     929        .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
     930$C$DW$57        .dwtag  DW_TAG_member
     931        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$31)
     932        .dwattr $C$DW$57, DW_AT_name("CTBIR0")
     933        .dwattr $C$DW$57, DW_AT_TI_symbol_name("CTBIR0")
     934        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   18

     935        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     936        .dwattr $C$DW$57, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     937        .dwattr $C$DW$57, DW_AT_decl_line(0x68)
     938        .dwattr $C$DW$57, DW_AT_decl_column(0x15)
     939
     940$C$DW$58        .dwtag  DW_TAG_member
     941        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$42)
     942        .dwattr $C$DW$58, DW_AT_name("CTBIR0_bit")
     943        .dwattr $C$DW$58, DW_AT_TI_symbol_name("CTBIR0_bit")
     944        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     946        .dwattr $C$DW$58, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     947        .dwattr $C$DW$58, DW_AT_decl_line(0x6f)
     948        .dwattr $C$DW$58, DW_AT_decl_column(0x05)
     949
     950        .dwattr $C$DW$T$43, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     951        .dwattr $C$DW$T$43, DW_AT_decl_line(0x67)
     952        .dwattr $C$DW$T$43, DW_AT_decl_column(0x08)
     953        .dwendtag $C$DW$T$43
     954
     955
     956$C$DW$T$45      .dwtag  DW_TAG_union_type
     957        .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
     958$C$DW$59        .dwtag  DW_TAG_member
     959        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$31)
     960        .dwattr $C$DW$59, DW_AT_name("CTBIR1")
     961        .dwattr $C$DW$59, DW_AT_TI_symbol_name("CTBIR1")
     962        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     964        .dwattr $C$DW$59, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     965        .dwattr $C$DW$59, DW_AT_decl_line(0x75)
     966        .dwattr $C$DW$59, DW_AT_decl_column(0x15)
     967
     968$C$DW$60        .dwtag  DW_TAG_member
     969        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$44)
     970        .dwattr $C$DW$60, DW_AT_name("CTBIR1_bit")
     971        .dwattr $C$DW$60, DW_AT_TI_symbol_name("CTBIR1_bit")
     972        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     974        .dwattr $C$DW$60, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     975        .dwattr $C$DW$60, DW_AT_decl_line(0x7c)
     976        .dwattr $C$DW$60, DW_AT_decl_column(0x05)
     977
     978        .dwattr $C$DW$T$45, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     979        .dwattr $C$DW$T$45, DW_AT_decl_line(0x74)
     980        .dwattr $C$DW$T$45, DW_AT_decl_column(0x08)
     981        .dwendtag $C$DW$T$45
     982
     983
     984$C$DW$T$47      .dwtag  DW_TAG_union_type
     985        .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
     986$C$DW$61        .dwtag  DW_TAG_member
     987        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$31)
     988        .dwattr $C$DW$61, DW_AT_name("CTPPR0")
     989        .dwattr $C$DW$61, DW_AT_TI_symbol_name("CTPPR0")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   19

     990        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     991        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     992        .dwattr $C$DW$61, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     993        .dwattr $C$DW$61, DW_AT_decl_line(0x82)
     994        .dwattr $C$DW$61, DW_AT_decl_column(0x15)
     995
     996$C$DW$62        .dwtag  DW_TAG_member
     997        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$46)
     998        .dwattr $C$DW$62, DW_AT_name("CTPPR0_bit")
     999        .dwattr $C$DW$62, DW_AT_TI_symbol_name("CTPPR0_bit")
    1000        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1002        .dwattr $C$DW$62, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1003        .dwattr $C$DW$62, DW_AT_decl_line(0x87)
    1004        .dwattr $C$DW$62, DW_AT_decl_column(0x05)
    1005
    1006        .dwattr $C$DW$T$47, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1007        .dwattr $C$DW$T$47, DW_AT_decl_line(0x81)
    1008        .dwattr $C$DW$T$47, DW_AT_decl_column(0x08)
    1009        .dwendtag $C$DW$T$47
    1010
    1011
    1012$C$DW$T$49      .dwtag  DW_TAG_union_type
    1013        .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    1014$C$DW$63        .dwtag  DW_TAG_member
    1015        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$31)
    1016        .dwattr $C$DW$63, DW_AT_name("CTPPR1")
    1017        .dwattr $C$DW$63, DW_AT_TI_symbol_name("CTPPR1")
    1018        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1020        .dwattr $C$DW$63, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1021        .dwattr $C$DW$63, DW_AT_decl_line(0x8d)
    1022        .dwattr $C$DW$63, DW_AT_decl_column(0x15)
    1023
    1024$C$DW$64        .dwtag  DW_TAG_member
    1025        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$48)
    1026        .dwattr $C$DW$64, DW_AT_name("CTPPR1_bit")
    1027        .dwattr $C$DW$64, DW_AT_TI_symbol_name("CTPPR1_bit")
    1028        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1030        .dwattr $C$DW$64, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1031        .dwattr $C$DW$64, DW_AT_decl_line(0x92)
    1032        .dwattr $C$DW$64, DW_AT_decl_column(0x05)
    1033
    1034        .dwattr $C$DW$T$49, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1035        .dwattr $C$DW$T$49, DW_AT_decl_line(0x8c)
    1036        .dwattr $C$DW$T$49, DW_AT_decl_column(0x08)
    1037        .dwendtag $C$DW$T$49
    1038
    1039$C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1040        .dwattr $C$DW$T$2, DW_AT_name("void")
    1041
    1042$C$DW$T$4       .dwtag  DW_TAG_base_type
    1043        .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1044        .dwattr $C$DW$T$4, DW_AT_name("bool")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   20

    1045        .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1046
    1047$C$DW$T$5       .dwtag  DW_TAG_base_type
    1048        .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1049        .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1050        .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1051
    1052$C$DW$T$6       .dwtag  DW_TAG_base_type
    1053        .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1054        .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1055        .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1056
    1057$C$DW$T$7       .dwtag  DW_TAG_base_type
    1058        .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1059        .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1060        .dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
    1061
    1062$C$DW$T$8       .dwtag  DW_TAG_base_type
    1063        .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1064        .dwattr $C$DW$T$8, DW_AT_name("short")
    1065        .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1066
    1067$C$DW$T$9       .dwtag  DW_TAG_base_type
    1068        .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1069        .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1070        .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1071
    1072$C$DW$T$10      .dwtag  DW_TAG_base_type
    1073        .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1074        .dwattr $C$DW$T$10, DW_AT_name("int")
    1075        .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1076
    1077$C$DW$T$11      .dwtag  DW_TAG_base_type
    1078        .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1079        .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1080        .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1081
    1082$C$DW$T$28      .dwtag  DW_TAG_typedef
    1083        .dwattr $C$DW$T$28, DW_AT_name("uint32_t")
    1084        .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$11)
    1085        .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1086        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/stdint.h")
    1087        .dwattr $C$DW$T$28, DW_AT_decl_line(0x41)
    1088        .dwattr $C$DW$T$28, DW_AT_decl_column(0x1c)
    1089
    1090
    1091$C$DW$T$29      .dwtag  DW_TAG_array_type
    1092        .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1093        .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1094        .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    1095$C$DW$65        .dwtag  DW_TAG_subrange_type
    1096        .dwattr $C$DW$65, DW_AT_upper_bound(0x02)
    1097
    1098        .dwendtag $C$DW$T$29
    1099
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:07 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru_timer.asm                                                    PAGE   21

    1100$C$DW$T$31      .dwtag  DW_TAG_volatile_type
