PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.3 *
       3;* Date/Time created: Wed Aug 12 00:15:04 2020                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("pru0_mcp3208_rpmsg.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.3 Copyright (c) 2012-2018 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/pru-mcp3208-6ch/pru0_mcp3208_rpmsg")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14        .weak   ||CT_CFG||
      15 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      16$C$DW$1 .dwtag  DW_TAG_variable
      17        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      19        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

     831 00000180 000000CF1EFFDD          QBBC      ||$C$L5||, r31, 0x1e  ; [ALU_PRU] |99| 
     832;* --------------------------------------------------------------------------*
     833 00000184 0000005700E1DC          QBEQ      ||$C$L5||, r1, 0x00   ; [ALU_PRU] |99| $O$v2
     834;* --------------------------------------------------------------------------*
     835;*** 102        -----------------------    if ( (status = pru_rpmsg_receive(&transport, &src, &dst, &i
     836        .dwpsn  file "pru0_mcp3208_rpmsg.c",line 102,column 7,is_stmt,isa 0
     837 00000188 0000000100E2EE          ADD       r14, r2, 0            ; [ALU_PRU] |102| transport,transport
     838 0000018c 000000013CE2EF          ADD       r15, r2, 60           ; [ALU_PRU] |102| src,src
     839 00000190 000000013EE2F0          ADD       r16, r2, 62           ; [ALU_PRU] |102| dst,dst
     840 00000194 000000240000F1!         LDI       r17, ||in_payload||   ; [ALU_PRU] |102| in_payload
     841 00000198 0000000140E2F2          ADD       r18, r2, 64           ; [ALU_PRU] |102| len,len
     842$C$DW$61        .dwtag  DW_TAG_TI_branch
     843        .dwattr $C$DW$61, DW_AT_low_pc(0x00)
     844        .dwattr $C$DW$61, DW_AT_name("pru_rpmsg_receive")
     845        .dwattr $C$DW$61, DW_AT_TI_call
     846
     847 0000019c 000000230000C3!         JAL       r3.w2, ||pru_rpmsg_receive|| ; [ALU_PRU] |102| pru_rpmsg_receive
     848 000001a0 00000024FFFF80          LDI       r0.w0, 0xffff         ; [ALU_PRU] |102| 
     849 000001a4 000000688E8006          QBNE      ||$C$L9||, r0.w0, r14.w0 ; [ALU_PRU] |102| status
     850;* --------------------------------------------------------------------------*
     851;*** 106        -----------------------    C$3 = (volatile struct $$fake19 *)K$4+36;
     852;*** 106        -----------------------    *C$3 = *C$3&0xfffffc00u|0x11u;
     853        .dwpsn  file "pru0_mcp3208_rpmsg.c",line 106,column 9,is_stmt,isa 0
     854 000001a8 0000000124E9E0          ADD       r0, r9, 0x24          ; [ALU_PRU] |106| $O$C3,$O$K4
     855 000001ac 000000F1002081          LBBO      &r1, r0, 0, 4         ; [ALU_PRU] |106| $O$C3
     856 000001b0 00000010E5E1E1          AND       r1, r1, r5            ; [ALU_PRU] |106| 
     857 000001b4 0000001311E1E1          OR        r1, r1, 0x11          ; [ALU_PRU] |106| 
     858 000001b8 000000E1002081          SBBO      &r1, r0, 0, 4         ; [ALU_PRU] |106| $O$C3
     859;* --------------------------------------------------------------------------*
     860 000001bc                 ||$C$L9||:    
     861;***    -----------------------g14:
     862;*** 109        -----------------------    if ( !status ) goto g6;
     863        .dwpsn  file "pru0_mcp3208_rpmsg.c",line 109,column 7,is_stmt,isa 0
     864 000001bc 00000057008EBA          QBEQ      ||$C$L3||, r14.w0, 0x00 ; [ALU_PRU] |109| status
     865;* --------------------------------------------------------------------------*
     866;***    -----------------------    v$2 = (int)*K$31;
     867 000001c0 000000F1000400          LBBO      &r0.b0, r4, 0, 1      ; [ALU_PRU] $O$K31
     868 000001c4 00000021000000!         JMP       ||$C$L4||             ; [ALU_PRU] 
     869;* --------------------------------------------------------------------------*
     870        .dwattr $C$DW$35, DW_AT_TI_end_file("pru0_mcp3208_rpmsg.c")
     871        .dwattr $C$DW$35, DW_AT_TI_end_line(0x78)
     872        .dwattr $C$DW$35, DW_AT_TI_end_column(0x01)
     873        .dwendentry
     874        .dwendtag $C$DW$35
     875
     876;******************************************************************************
     877;* STRINGS                                                                    *
     878;******************************************************************************
     879 00000000                         .sect   ".rodata:.string"
     880 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   17

         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
     881 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 1",0
         0000000b 00000000000068 
         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000031 
         00000013 00000000000000 
     882;*****************************************************************************
     883;* UNDEFINED EXTERNAL REFERENCES                                             *
     884;*****************************************************************************
     885        .global ||pru_rpmsg_init||
     886        .global ||pru_rpmsg_channel||
     887        .global ||pru_rpmsg_receive||
     888        .global ||pru_rpmsg_send||
     889        .global ||memcpy||
     890
     891;******************************************************************************
     892;* TYPE INFORMATION                                                           *
     893;******************************************************************************
     894
     895$C$DW$T$19      .dwtag  DW_TAG_structure_type
     896        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     897$C$DW$62        .dwtag  DW_TAG_member
     898        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     899        .dwattr $C$DW$62, DW_AT_name("REVID")
     900        .dwattr $C$DW$62, DW_AT_TI_symbol_name("REVID")
     901        .dwattr $C$DW$62, DW_AT_bit_offset(0x00)
     902        .dwattr $C$DW$62, DW_AT_bit_size(0x20)
     903        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     905        .dwattr $C$DW$62, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     906        .dwattr $C$DW$62, DW_AT_decl_line(0x2d)
     907        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     908
     909        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     910        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     911        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     912        .dwendtag $C$DW$T$19
     913
     914$C$DW$T$113     .dwtag  DW_TAG_volatile_type
     915        .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$19)
     916
     917
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   18

     918$C$DW$T$20      .dwtag  DW_TAG_structure_type
     919        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     920$C$DW$63        .dwtag  DW_TAG_member
     921        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     922        .dwattr $C$DW$63, DW_AT_name("IDLE_MODE")
     923        .dwattr $C$DW$63, DW_AT_TI_symbol_name("IDLE_MODE")
     924        .dwattr $C$DW$63, DW_AT_bit_offset(0x1e)
     925        .dwattr $C$DW$63, DW_AT_bit_size(0x02)
     926        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     928        .dwattr $C$DW$63, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     929        .dwattr $C$DW$63, DW_AT_decl_line(0x37)
     930        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     931
     932$C$DW$64        .dwtag  DW_TAG_member
     933        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     934        .dwattr $C$DW$64, DW_AT_name("STANDBY_MODE")
     935        .dwattr $C$DW$64, DW_AT_TI_symbol_name("STANDBY_MODE")
     936        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c)
     937        .dwattr $C$DW$64, DW_AT_bit_size(0x02)
     938        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     940        .dwattr $C$DW$64, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     941        .dwattr $C$DW$64, DW_AT_decl_line(0x38)
     942        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     943
     944$C$DW$65        .dwtag  DW_TAG_member
     945        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     946        .dwattr $C$DW$65, DW_AT_name("STANDBY_INIT")
     947        .dwattr $C$DW$65, DW_AT_TI_symbol_name("STANDBY_INIT")
     948        .dwattr $C$DW$65, DW_AT_bit_offset(0x1b)
     949        .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     950        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     952        .dwattr $C$DW$65, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     953        .dwattr $C$DW$65, DW_AT_decl_line(0x39)
     954        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     955
     956$C$DW$66        .dwtag  DW_TAG_member
     957        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     958        .dwattr $C$DW$66, DW_AT_name("SUB_MWAIT")
     959        .dwattr $C$DW$66, DW_AT_TI_symbol_name("SUB_MWAIT")
     960        .dwattr $C$DW$66, DW_AT_bit_offset(0x1a)
     961        .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     962        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     964        .dwattr $C$DW$66, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     965        .dwattr $C$DW$66, DW_AT_decl_line(0x3a)
     966        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     967
     968$C$DW$67        .dwtag  DW_TAG_member
     969        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     970        .dwattr $C$DW$67, DW_AT_name("rsvd6")
     971        .dwattr $C$DW$67, DW_AT_TI_symbol_name("rsvd6")
     972        .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   19

     973        .dwattr $C$DW$67, DW_AT_bit_size(0x1a)
     974        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     976        .dwattr $C$DW$67, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
     977        .dwattr $C$DW$67, DW_AT_decl_line(0x3b)
     978        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     979
     980        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
     981        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     982        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     983        .dwendtag $C$DW$T$20
     984
     985$C$DW$T$115     .dwtag  DW_TAG_volatile_type
     986        .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$20)
     987
     988
     989$C$DW$T$21      .dwtag  DW_TAG_structure_type
     990        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     991$C$DW$68        .dwtag  DW_TAG_member
     992        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     993        .dwattr $C$DW$68, DW_AT_name("PRU0_GPI_MODE")
     994        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     995        .dwattr $C$DW$68, DW_AT_bit_offset(0x1e)
     996        .dwattr $C$DW$68, DW_AT_bit_size(0x02)
     997        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     999        .dwattr $C$DW$68, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1000        .dwattr $C$DW$68, DW_AT_decl_line(0x45)
    1001        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1002
    1003$C$DW$69        .dwtag  DW_TAG_member
    1004        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1005        .dwattr $C$DW$69, DW_AT_name("PRU0_GPI_CLK_MODE")
    1006        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1007        .dwattr $C$DW$69, DW_AT_bit_offset(0x1d)
    1008        .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1009        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1011        .dwattr $C$DW$69, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1012        .dwattr $C$DW$69, DW_AT_decl_line(0x46)
    1013        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1014
    1015$C$DW$70        .dwtag  DW_TAG_member
    1016        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1017        .dwattr $C$DW$70, DW_AT_name("PRU0_GPI_DIV0")
    1018        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1019        .dwattr $C$DW$70, DW_AT_bit_offset(0x18)
    1020        .dwattr $C$DW$70, DW_AT_bit_size(0x05)
    1021        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1023        .dwattr $C$DW$70, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1024        .dwattr $C$DW$70, DW_AT_decl_line(0x47)
    1025        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1026
    1027$C$DW$71        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   20

    1028        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1029        .dwattr $C$DW$71, DW_AT_name("PRU0_GPI_DIV1")
    1030        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1031        .dwattr $C$DW$71, DW_AT_bit_offset(0x13)
    1032        .dwattr $C$DW$71, DW_AT_bit_size(0x05)
    1033        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1035        .dwattr $C$DW$71, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1036        .dwattr $C$DW$71, DW_AT_decl_line(0x48)
    1037        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1038
    1039$C$DW$72        .dwtag  DW_TAG_member
    1040        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1041        .dwattr $C$DW$72, DW_AT_name("PRU0_GPI_SB")
    1042        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1043        .dwattr $C$DW$72, DW_AT_bit_offset(0x12)
    1044        .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1045        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1047        .dwattr $C$DW$72, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1048        .dwattr $C$DW$72, DW_AT_decl_line(0x49)
    1049        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1050
    1051$C$DW$73        .dwtag  DW_TAG_member
    1052        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1053        .dwattr $C$DW$73, DW_AT_name("PRU0_GPO_MODE")
    1054        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1055        .dwattr $C$DW$73, DW_AT_bit_offset(0x11)
    1056        .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1057        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1059        .dwattr $C$DW$73, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1060        .dwattr $C$DW$73, DW_AT_decl_line(0x4a)
    1061        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1062
    1063$C$DW$74        .dwtag  DW_TAG_member
    1064        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1065        .dwattr $C$DW$74, DW_AT_name("PRU0_GPO_DIV0")
    1066        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1067        .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
    1068        .dwattr $C$DW$74, DW_AT_bit_size(0x05)
    1069        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1071        .dwattr $C$DW$74, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1072        .dwattr $C$DW$74, DW_AT_decl_line(0x4b)
    1073        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1074
    1075$C$DW$75        .dwtag  DW_TAG_member
    1076        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1077        .dwattr $C$DW$75, DW_AT_name("PRU0_GPO_DIV1")
    1078        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1079        .dwattr $C$DW$75, DW_AT_bit_offset(0x07)
    1080        .dwattr $C$DW$75, DW_AT_bit_size(0x05)
    1081        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   21

    1083        .dwattr $C$DW$75, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1084        .dwattr $C$DW$75, DW_AT_decl_line(0x4c)
    1085        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1086
    1087$C$DW$76        .dwtag  DW_TAG_member
    1088        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1089        .dwattr $C$DW$76, DW_AT_name("PRU0_GPO_SH_SEL")
    1090        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1091        .dwattr $C$DW$76, DW_AT_bit_offset(0x06)
    1092        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1093        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1095        .dwattr $C$DW$76, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1096        .dwattr $C$DW$76, DW_AT_decl_line(0x4d)
    1097        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1098
    1099$C$DW$77        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1101        .dwattr $C$DW$77, DW_AT_name("rsvd26")
    1102        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd26")
    1103        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1104        .dwattr $C$DW$77, DW_AT_bit_size(0x06)
    1105        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1107        .dwattr $C$DW$77, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1108        .dwattr $C$DW$77, DW_AT_decl_line(0x4e)
    1109        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1110
    1111        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1112        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1113        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1114        .dwendtag $C$DW$T$21
    1115
    1116$C$DW$T$117     .dwtag  DW_TAG_volatile_type
    1117        .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$21)
    1118
    1119
    1120$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1121        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1122$C$DW$78        .dwtag  DW_TAG_member
    1123        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1124        .dwattr $C$DW$78, DW_AT_name("PRU1_GPI_MODE")
    1125        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1126        .dwattr $C$DW$78, DW_AT_bit_offset(0x1e)
    1127        .dwattr $C$DW$78, DW_AT_bit_size(0x02)
    1128        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1130        .dwattr $C$DW$78, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1131        .dwattr $C$DW$78, DW_AT_decl_line(0x58)
    1132        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1133
    1134$C$DW$79        .dwtag  DW_TAG_member
    1135        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1136        .dwattr $C$DW$79, DW_AT_name("PRU1_GPI_CLK_MODE")
    1137        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   22

    1138        .dwattr $C$DW$79, DW_AT_bit_offset(0x1d)
    1139        .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1140        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1142        .dwattr $C$DW$79, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1143        .dwattr $C$DW$79, DW_AT_decl_line(0x59)
    1144        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1145
    1146$C$DW$80        .dwtag  DW_TAG_member
    1147        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1148        .dwattr $C$DW$80, DW_AT_name("PRU1_GPI_DIV0")
    1149        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1150        .dwattr $C$DW$80, DW_AT_bit_offset(0x18)
    1151        .dwattr $C$DW$80, DW_AT_bit_size(0x05)
    1152        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1154        .dwattr $C$DW$80, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1155        .dwattr $C$DW$80, DW_AT_decl_line(0x5a)
    1156        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1157
    1158$C$DW$81        .dwtag  DW_TAG_member
    1159        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1160        .dwattr $C$DW$81, DW_AT_name("PRU1_GPI_DIV1")
    1161        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1162        .dwattr $C$DW$81, DW_AT_bit_offset(0x13)
    1163        .dwattr $C$DW$81, DW_AT_bit_size(0x05)
    1164        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$81, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1167        .dwattr $C$DW$81, DW_AT_decl_line(0x5b)
    1168        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1169
    1170$C$DW$82        .dwtag  DW_TAG_member
    1171        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1172        .dwattr $C$DW$82, DW_AT_name("PRU1_GPI_SB")
    1173        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1174        .dwattr $C$DW$82, DW_AT_bit_offset(0x12)
    1175        .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1176        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1178        .dwattr $C$DW$82, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1179        .dwattr $C$DW$82, DW_AT_decl_line(0x5c)
    1180        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1181
    1182$C$DW$83        .dwtag  DW_TAG_member
    1183        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1184        .dwattr $C$DW$83, DW_AT_name("PRU1_GPO_MODE")
    1185        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1186        .dwattr $C$DW$83, DW_AT_bit_offset(0x11)
    1187        .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1188        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1190        .dwattr $C$DW$83, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1191        .dwattr $C$DW$83, DW_AT_decl_line(0x5d)
    1192        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   23

    1193
    1194$C$DW$84        .dwtag  DW_TAG_member
    1195        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1196        .dwattr $C$DW$84, DW_AT_name("PRU1_GPO_DIV0")
    1197        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1198        .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1199        .dwattr $C$DW$84, DW_AT_bit_size(0x05)
    1200        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$84, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1203        .dwattr $C$DW$84, DW_AT_decl_line(0x5e)
    1204        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1205
    1206$C$DW$85        .dwtag  DW_TAG_member
    1207        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1208        .dwattr $C$DW$85, DW_AT_name("PRU1_GPO_DIV1")
    1209        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1210        .dwattr $C$DW$85, DW_AT_bit_offset(0x07)
    1211        .dwattr $C$DW$85, DW_AT_bit_size(0x05)
    1212        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1214        .dwattr $C$DW$85, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1215        .dwattr $C$DW$85, DW_AT_decl_line(0x5f)
    1216        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1217
    1218$C$DW$86        .dwtag  DW_TAG_member
    1219        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1220        .dwattr $C$DW$86, DW_AT_name("PRU1_GPO_SH_SEL")
    1221        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1222        .dwattr $C$DW$86, DW_AT_bit_offset(0x06)
    1223        .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1224        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1226        .dwattr $C$DW$86, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1227        .dwattr $C$DW$86, DW_AT_decl_line(0x60)
    1228        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1229
    1230$C$DW$87        .dwtag  DW_TAG_member
    1231        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1232        .dwattr $C$DW$87, DW_AT_name("rsvd26")
    1233        .dwattr $C$DW$87, DW_AT_TI_symbol_name("rsvd26")
    1234        .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1235        .dwattr $C$DW$87, DW_AT_bit_size(0x06)
    1236        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1238        .dwattr $C$DW$87, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1239        .dwattr $C$DW$87, DW_AT_decl_line(0x61)
    1240        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1241
    1242        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1243        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1244        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1245        .dwendtag $C$DW$T$22
    1246
    1247$C$DW$T$119     .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   24

    1248        .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$22)
    1249
    1250
    1251$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1252        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1253$C$DW$88        .dwtag  DW_TAG_member
    1254        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1255        .dwattr $C$DW$88, DW_AT_name("PRU0_CLK_STOP_REQ")
    1256        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1257        .dwattr $C$DW$88, DW_AT_bit_offset(0x1f)
    1258        .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1259        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1261        .dwattr $C$DW$88, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1262        .dwattr $C$DW$88, DW_AT_decl_line(0x6b)
    1263        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1264
    1265$C$DW$89        .dwtag  DW_TAG_member
    1266        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1267        .dwattr $C$DW$89, DW_AT_name("PRU0_CLK_STOP_ACK")
    1268        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1269        .dwattr $C$DW$89, DW_AT_bit_offset(0x1e)
    1270        .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1271        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1273        .dwattr $C$DW$89, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1274        .dwattr $C$DW$89, DW_AT_decl_line(0x6c)
    1275        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1276
    1277$C$DW$90        .dwtag  DW_TAG_member
    1278        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1279        .dwattr $C$DW$90, DW_AT_name("PRU0_CLK_EN")
    1280        .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1281        .dwattr $C$DW$90, DW_AT_bit_offset(0x1d)
    1282        .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1283        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$90, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1286        .dwattr $C$DW$90, DW_AT_decl_line(0x6d)
    1287        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1288
    1289$C$DW$91        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$91, DW_AT_name("PRU1_CLK_STOP_REQ")
    1292        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1293        .dwattr $C$DW$91, DW_AT_bit_offset(0x1c)
    1294        .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1295        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1297        .dwattr $C$DW$91, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1298        .dwattr $C$DW$91, DW_AT_decl_line(0x6e)
    1299        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1300
    1301$C$DW$92        .dwtag  DW_TAG_member
    1302        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   25

    1303        .dwattr $C$DW$92, DW_AT_name("PRU1_CLK_STOP_ACK")
    1304        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1305        .dwattr $C$DW$92, DW_AT_bit_offset(0x1b)
    1306        .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1307        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1309        .dwattr $C$DW$92, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1310        .dwattr $C$DW$92, DW_AT_decl_line(0x6f)
    1311        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1312
    1313$C$DW$93        .dwtag  DW_TAG_member
    1314        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1315        .dwattr $C$DW$93, DW_AT_name("PRU1_CLK_EN")
    1316        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1317        .dwattr $C$DW$93, DW_AT_bit_offset(0x1a)
    1318        .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1319        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1321        .dwattr $C$DW$93, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1322        .dwattr $C$DW$93, DW_AT_decl_line(0x70)
    1323        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1324
    1325$C$DW$94        .dwtag  DW_TAG_member
    1326        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1327        .dwattr $C$DW$94, DW_AT_name("INTC_CLK_STOP_REQ")
    1328        .dwattr $C$DW$94, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1329        .dwattr $C$DW$94, DW_AT_bit_offset(0x19)
    1330        .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1331        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$94, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1334        .dwattr $C$DW$94, DW_AT_decl_line(0x71)
    1335        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1336
    1337$C$DW$95        .dwtag  DW_TAG_member
    1338        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1339        .dwattr $C$DW$95, DW_AT_name("INTC_CLK_STOP_ACK")
    1340        .dwattr $C$DW$95, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1341        .dwattr $C$DW$95, DW_AT_bit_offset(0x18)
    1342        .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1343        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$95, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1346        .dwattr $C$DW$95, DW_AT_decl_line(0x72)
    1347        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1348
    1349$C$DW$96        .dwtag  DW_TAG_member
    1350        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1351        .dwattr $C$DW$96, DW_AT_name("INTC_CLK_EN")
    1352        .dwattr $C$DW$96, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1353        .dwattr $C$DW$96, DW_AT_bit_offset(0x17)
    1354        .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1355        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1357        .dwattr $C$DW$96, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   26

    1358        .dwattr $C$DW$96, DW_AT_decl_line(0x73)
    1359        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1360
    1361$C$DW$97        .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1363        .dwattr $C$DW$97, DW_AT_name("UART_CLK_STOP_REQ")
    1364        .dwattr $C$DW$97, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1365        .dwattr $C$DW$97, DW_AT_bit_offset(0x16)
    1366        .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1367        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1369        .dwattr $C$DW$97, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1370        .dwattr $C$DW$97, DW_AT_decl_line(0x74)
    1371        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1372
    1373$C$DW$98        .dwtag  DW_TAG_member
    1374        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1375        .dwattr $C$DW$98, DW_AT_name("UART_CLK_STOP_ACK")
    1376        .dwattr $C$DW$98, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1377        .dwattr $C$DW$98, DW_AT_bit_offset(0x15)
    1378        .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1379        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1381        .dwattr $C$DW$98, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1382        .dwattr $C$DW$98, DW_AT_decl_line(0x75)
    1383        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1384
    1385$C$DW$99        .dwtag  DW_TAG_member
    1386        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1387        .dwattr $C$DW$99, DW_AT_name("UART_CLK_EN")
    1388        .dwattr $C$DW$99, DW_AT_TI_symbol_name("UART_CLK_EN")
    1389        .dwattr $C$DW$99, DW_AT_bit_offset(0x14)
    1390        .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1391        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1393        .dwattr $C$DW$99, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/p
    1394        .dwattr $C$DW$99, DW_AT_decl_line(0x76)
    1395        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1396
    1397$C$DW$100       .dwtag  DW_TAG_member
    1398        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1399        .dwattr $C$DW$100, DW_AT_name("ECAP_CLK_STOP_REQ")
    1400        .dwattr $C$DW$100, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1401        .dwattr $C$DW$100, DW_AT_bit_offset(0x13)
    1402        .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1403        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1405        .dwattr $C$DW$100, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1406        .dwattr $C$DW$100, DW_AT_decl_line(0x77)
    1407        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1408
    1409$C$DW$101       .dwtag  DW_TAG_member
    1410        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1411        .dwattr $C$DW$101, DW_AT_name("ECAP_CLK_STOP_ACK")
    1412        .dwattr $C$DW$101, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   27

    1413        .dwattr $C$DW$101, DW_AT_bit_offset(0x12)
    1414        .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1415        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1417        .dwattr $C$DW$101, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1418        .dwattr $C$DW$101, DW_AT_decl_line(0x78)
    1419        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1420
    1421$C$DW$102       .dwtag  DW_TAG_member
    1422        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1423        .dwattr $C$DW$102, DW_AT_name("ECAP_CLK_EN")
    1424        .dwattr $C$DW$102, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1425        .dwattr $C$DW$102, DW_AT_bit_offset(0x11)
    1426        .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1427        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1429        .dwattr $C$DW$102, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1430        .dwattr $C$DW$102, DW_AT_decl_line(0x79)
    1431        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1432
    1433$C$DW$103       .dwtag  DW_TAG_member
    1434        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1435        .dwattr $C$DW$103, DW_AT_name("IEP_CLK_STOP_REQ")
    1436        .dwattr $C$DW$103, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1437        .dwattr $C$DW$103, DW_AT_bit_offset(0x10)
    1438        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1439        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$103, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1442        .dwattr $C$DW$103, DW_AT_decl_line(0x7a)
    1443        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1444
    1445$C$DW$104       .dwtag  DW_TAG_member
    1446        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1447        .dwattr $C$DW$104, DW_AT_name("IEP_CLK_STOP_ACK")
    1448        .dwattr $C$DW$104, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1449        .dwattr $C$DW$104, DW_AT_bit_offset(0x0f)
    1450        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1451        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1453        .dwattr $C$DW$104, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1454        .dwattr $C$DW$104, DW_AT_decl_line(0x7b)
    1455        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1456
    1457$C$DW$105       .dwtag  DW_TAG_member
    1458        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1459        .dwattr $C$DW$105, DW_AT_name("IEP_CLK_EN")
    1460        .dwattr $C$DW$105, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1461        .dwattr $C$DW$105, DW_AT_bit_offset(0x0e)
    1462        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1463        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1465        .dwattr $C$DW$105, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1466        .dwattr $C$DW$105, DW_AT_decl_line(0x7c)
    1467        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   28

    1468
    1469$C$DW$106       .dwtag  DW_TAG_member
    1470        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1471        .dwattr $C$DW$106, DW_AT_name("rsvd18")
    1472        .dwattr $C$DW$106, DW_AT_TI_symbol_name("rsvd18")
    1473        .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    1474        .dwattr $C$DW$106, DW_AT_bit_size(0x0e)
    1475        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$106, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1478        .dwattr $C$DW$106, DW_AT_decl_line(0x7d)
    1479        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1480
    1481        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1482        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1483        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1484        .dwendtag $C$DW$T$23
    1485
    1486$C$DW$T$121     .dwtag  DW_TAG_volatile_type
    1487        .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$23)
    1488
    1489
    1490$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1491        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1492$C$DW$107       .dwtag  DW_TAG_member
    1493        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1494        .dwattr $C$DW$107, DW_AT_name("PRU0_IMEM_PE_RAW")
    1495        .dwattr $C$DW$107, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1496        .dwattr $C$DW$107, DW_AT_bit_offset(0x1c)
    1497        .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1498        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1500        .dwattr $C$DW$107, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1501        .dwattr $C$DW$107, DW_AT_decl_line(0x87)
    1502        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1503
    1504$C$DW$108       .dwtag  DW_TAG_member
    1505        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1506        .dwattr $C$DW$108, DW_AT_name("PRU0_DMEM_PE_RAW")
    1507        .dwattr $C$DW$108, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1508        .dwattr $C$DW$108, DW_AT_bit_offset(0x18)
    1509        .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1510        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1512        .dwattr $C$DW$108, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1513        .dwattr $C$DW$108, DW_AT_decl_line(0x88)
    1514        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1515
    1516$C$DW$109       .dwtag  DW_TAG_member
    1517        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1518        .dwattr $C$DW$109, DW_AT_name("PRU1_IMEM_PE_RAW")
    1519        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1520        .dwattr $C$DW$109, DW_AT_bit_offset(0x14)
    1521        .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1522        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   29

    1523        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1524        .dwattr $C$DW$109, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1525        .dwattr $C$DW$109, DW_AT_decl_line(0x89)
    1526        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1527
    1528$C$DW$110       .dwtag  DW_TAG_member
    1529        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1530        .dwattr $C$DW$110, DW_AT_name("PRU1_DMEM_PE_RAW")
    1531        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1532        .dwattr $C$DW$110, DW_AT_bit_offset(0x10)
    1533        .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1534        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1536        .dwattr $C$DW$110, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1537        .dwattr $C$DW$110, DW_AT_decl_line(0x8a)
    1538        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1539
    1540$C$DW$111       .dwtag  DW_TAG_member
    1541        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1542        .dwattr $C$DW$111, DW_AT_name("RAM_PE_RAW")
    1543        .dwattr $C$DW$111, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1544        .dwattr $C$DW$111, DW_AT_bit_offset(0x0c)
    1545        .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1546        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1548        .dwattr $C$DW$111, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1549        .dwattr $C$DW$111, DW_AT_decl_line(0x8b)
    1550        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1551
    1552$C$DW$112       .dwtag  DW_TAG_member
    1553        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1554        .dwattr $C$DW$112, DW_AT_name("rsvd20")
    1555        .dwattr $C$DW$112, DW_AT_TI_symbol_name("rsvd20")
    1556        .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    1557        .dwattr $C$DW$112, DW_AT_bit_size(0x0c)
    1558        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1560        .dwattr $C$DW$112, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1561        .dwattr $C$DW$112, DW_AT_decl_line(0x8c)
    1562        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1563
    1564        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1565        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1566        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1567        .dwendtag $C$DW$T$24
    1568
    1569$C$DW$T$123     .dwtag  DW_TAG_volatile_type
    1570        .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$24)
    1571
    1572
    1573$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1574        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1575$C$DW$113       .dwtag  DW_TAG_member
    1576        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1577        .dwattr $C$DW$113, DW_AT_name("PRU0_IMEM_PE")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   30

    1578        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1579        .dwattr $C$DW$113, DW_AT_bit_offset(0x1c)
    1580        .dwattr $C$DW$113, DW_AT_bit_size(0x04)
    1581        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1583        .dwattr $C$DW$113, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1584        .dwattr $C$DW$113, DW_AT_decl_line(0x96)
    1585        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1586
    1587$C$DW$114       .dwtag  DW_TAG_member
    1588        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1589        .dwattr $C$DW$114, DW_AT_name("PRU0_DMEM_PE")
    1590        .dwattr $C$DW$114, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1591        .dwattr $C$DW$114, DW_AT_bit_offset(0x18)
    1592        .dwattr $C$DW$114, DW_AT_bit_size(0x04)
    1593        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1595        .dwattr $C$DW$114, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1596        .dwattr $C$DW$114, DW_AT_decl_line(0x97)
    1597        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1598
    1599$C$DW$115       .dwtag  DW_TAG_member
    1600        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1601        .dwattr $C$DW$115, DW_AT_name("PRU1_IMEM_PE")
    1602        .dwattr $C$DW$115, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1603        .dwattr $C$DW$115, DW_AT_bit_offset(0x14)
    1604        .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1605        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1607        .dwattr $C$DW$115, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1608        .dwattr $C$DW$115, DW_AT_decl_line(0x98)
    1609        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1610
    1611$C$DW$116       .dwtag  DW_TAG_member
    1612        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1613        .dwattr $C$DW$116, DW_AT_name("PRU1_DMEM_PE")
    1614        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1615        .dwattr $C$DW$116, DW_AT_bit_offset(0x10)
    1616        .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1617        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1619        .dwattr $C$DW$116, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1620        .dwattr $C$DW$116, DW_AT_decl_line(0x99)
    1621        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1622
    1623$C$DW$117       .dwtag  DW_TAG_member
    1624        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1625        .dwattr $C$DW$117, DW_AT_name("RAM_PE")
    1626        .dwattr $C$DW$117, DW_AT_TI_symbol_name("RAM_PE")
    1627        .dwattr $C$DW$117, DW_AT_bit_offset(0x0c)
    1628        .dwattr $C$DW$117, DW_AT_bit_size(0x04)
    1629        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1631        .dwattr $C$DW$117, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1632        .dwattr $C$DW$117, DW_AT_decl_line(0x9a)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   31

    1633        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1634
    1635$C$DW$118       .dwtag  DW_TAG_member
    1636        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1637        .dwattr $C$DW$118, DW_AT_name("rsvd20")
    1638        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd20")
    1639        .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    1640        .dwattr $C$DW$118, DW_AT_bit_size(0x0c)
    1641        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$118, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1644        .dwattr $C$DW$118, DW_AT_decl_line(0x9b)
    1645        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1646
    1647        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1648        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1649        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1650        .dwendtag $C$DW$T$25
    1651
    1652$C$DW$T$125     .dwtag  DW_TAG_volatile_type
    1653        .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$25)
    1654
    1655
    1656$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1657        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1658$C$DW$119       .dwtag  DW_TAG_member
    1659        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1660        .dwattr $C$DW$119, DW_AT_name("PRU0_IMEM_PE_SET")
    1661        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1662        .dwattr $C$DW$119, DW_AT_bit_offset(0x1c)
    1663        .dwattr $C$DW$119, DW_AT_bit_size(0x04)
    1664        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1666        .dwattr $C$DW$119, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1667        .dwattr $C$DW$119, DW_AT_decl_line(0xa4)
    1668        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1669
    1670$C$DW$120       .dwtag  DW_TAG_member
    1671        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1672        .dwattr $C$DW$120, DW_AT_name("PRU0_DMEM_PE_SET")
    1673        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1674        .dwattr $C$DW$120, DW_AT_bit_offset(0x18)
    1675        .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1676        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1678        .dwattr $C$DW$120, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1679        .dwattr $C$DW$120, DW_AT_decl_line(0xa5)
    1680        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1681
    1682$C$DW$121       .dwtag  DW_TAG_member
    1683        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1684        .dwattr $C$DW$121, DW_AT_name("PRU1_IMEM_PE_SET")
    1685        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1686        .dwattr $C$DW$121, DW_AT_bit_offset(0x14)
    1687        .dwattr $C$DW$121, DW_AT_bit_size(0x04)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   32

    1688        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1690        .dwattr $C$DW$121, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1691        .dwattr $C$DW$121, DW_AT_decl_line(0xa6)
    1692        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1693
    1694$C$DW$122       .dwtag  DW_TAG_member
    1695        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1696        .dwattr $C$DW$122, DW_AT_name("PRU1_DMEM_PE_SET")
    1697        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1698        .dwattr $C$DW$122, DW_AT_bit_offset(0x10)
    1699        .dwattr $C$DW$122, DW_AT_bit_size(0x04)
    1700        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1702        .dwattr $C$DW$122, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1703        .dwattr $C$DW$122, DW_AT_decl_line(0xa7)
    1704        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1705
    1706$C$DW$123       .dwtag  DW_TAG_member
    1707        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$123, DW_AT_name("RAM_PE_SET")
    1709        .dwattr $C$DW$123, DW_AT_TI_symbol_name("RAM_PE_SET")
    1710        .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1711        .dwattr $C$DW$123, DW_AT_bit_size(0x04)
    1712        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1714        .dwattr $C$DW$123, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1715        .dwattr $C$DW$123, DW_AT_decl_line(0xa8)
    1716        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1717
    1718$C$DW$124       .dwtag  DW_TAG_member
    1719        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1720        .dwattr $C$DW$124, DW_AT_name("rsvd20")
    1721        .dwattr $C$DW$124, DW_AT_TI_symbol_name("rsvd20")
    1722        .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    1723        .dwattr $C$DW$124, DW_AT_bit_size(0x0c)
    1724        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1726        .dwattr $C$DW$124, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1727        .dwattr $C$DW$124, DW_AT_decl_line(0xa9)
    1728        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1729
    1730        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1731        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1732        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1733        .dwendtag $C$DW$T$26
    1734
    1735$C$DW$T$127     .dwtag  DW_TAG_volatile_type
    1736        .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$26)
    1737
    1738
    1739$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1740        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1741$C$DW$125       .dwtag  DW_TAG_member
    1742        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   33

    1743        .dwattr $C$DW$125, DW_AT_name("PRU0_IMEM_PE_CLR")
    1744        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1745        .dwattr $C$DW$125, DW_AT_bit_offset(0x1c)
    1746        .dwattr $C$DW$125, DW_AT_bit_size(0x04)
    1747        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1749        .dwattr $C$DW$125, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1750        .dwattr $C$DW$125, DW_AT_decl_line(0xb3)
    1751        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1752
    1753$C$DW$126       .dwtag  DW_TAG_member
    1754        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1755        .dwattr $C$DW$126, DW_AT_name("PRU0_DMEM_PE_CLR")
    1756        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1757        .dwattr $C$DW$126, DW_AT_bit_offset(0x18)
    1758        .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1759        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1761        .dwattr $C$DW$126, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1762        .dwattr $C$DW$126, DW_AT_decl_line(0xb4)
    1763        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1764
    1765$C$DW$127       .dwtag  DW_TAG_member
    1766        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1767        .dwattr $C$DW$127, DW_AT_name("PRU1_IMEM_PE_CLR")
    1768        .dwattr $C$DW$127, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1769        .dwattr $C$DW$127, DW_AT_bit_offset(0x14)
    1770        .dwattr $C$DW$127, DW_AT_bit_size(0x04)
    1771        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1773        .dwattr $C$DW$127, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1774        .dwattr $C$DW$127, DW_AT_decl_line(0xb5)
    1775        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1776
    1777$C$DW$128       .dwtag  DW_TAG_member
    1778        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1779        .dwattr $C$DW$128, DW_AT_name("PRU1_DMEM_PE_CLR")
    1780        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1781        .dwattr $C$DW$128, DW_AT_bit_offset(0x10)
    1782        .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1783        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1784        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1785        .dwattr $C$DW$128, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1786        .dwattr $C$DW$128, DW_AT_decl_line(0xb6)
    1787        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1788
    1789$C$DW$129       .dwtag  DW_TAG_member
    1790        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1791        .dwattr $C$DW$129, DW_AT_name("rsvd16")
    1792        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd16")
    1793        .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    1794        .dwattr $C$DW$129, DW_AT_bit_size(0x10)
    1795        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1797        .dwattr $C$DW$129, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   34

    1798        .dwattr $C$DW$129, DW_AT_decl_line(0xb7)
    1799        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1800
    1801        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1802        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1803        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1804        .dwendtag $C$DW$T$27
    1805
    1806$C$DW$T$129     .dwtag  DW_TAG_volatile_type
    1807        .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$27)
    1808
    1809
    1810$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1811        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1812$C$DW$130       .dwtag  DW_TAG_member
    1813        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1814        .dwattr $C$DW$130, DW_AT_name("PMAO_PRU0")
    1815        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PMAO_PRU0")
    1816        .dwattr $C$DW$130, DW_AT_bit_offset(0x1f)
    1817        .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1818        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1820        .dwattr $C$DW$130, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1821        .dwattr $C$DW$130, DW_AT_decl_line(0xc4)
    1822        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1823
    1824$C$DW$131       .dwtag  DW_TAG_member
    1825        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1826        .dwattr $C$DW$131, DW_AT_name("PMAO_PRU1")
    1827        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PMAO_PRU1")
    1828        .dwattr $C$DW$131, DW_AT_bit_offset(0x1e)
    1829        .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1830        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1832        .dwattr $C$DW$131, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1833        .dwattr $C$DW$131, DW_AT_decl_line(0xc5)
    1834        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1835
    1836$C$DW$132       .dwtag  DW_TAG_member
    1837        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1838        .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1839        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd2")
    1840        .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1841        .dwattr $C$DW$132, DW_AT_bit_size(0x1e)
    1842        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1844        .dwattr $C$DW$132, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1845        .dwattr $C$DW$132, DW_AT_decl_line(0xc6)
    1846        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1847
    1848        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1849        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1850        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1851        .dwendtag $C$DW$T$28
    1852
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   35

    1853$C$DW$T$131     .dwtag  DW_TAG_volatile_type
    1854        .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$28)
    1855
    1856
    1857$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1858        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1859$C$DW$133       .dwtag  DW_TAG_member
    1860        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1861        .dwattr $C$DW$133, DW_AT_name("OCP_EN")
    1862        .dwattr $C$DW$133, DW_AT_TI_symbol_name("OCP_EN")
    1863        .dwattr $C$DW$133, DW_AT_bit_offset(0x1f)
    1864        .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1865        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1867        .dwattr $C$DW$133, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1868        .dwattr $C$DW$133, DW_AT_decl_line(0xd3)
    1869        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1870
    1871$C$DW$134       .dwtag  DW_TAG_member
    1872        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1873        .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1874        .dwattr $C$DW$134, DW_AT_TI_symbol_name("rsvd1")
    1875        .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    1876        .dwattr $C$DW$134, DW_AT_bit_size(0x1f)
    1877        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1879        .dwattr $C$DW$134, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1880        .dwattr $C$DW$134, DW_AT_decl_line(0xd4)
    1881        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1882
    1883        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1884        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1885        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1886        .dwendtag $C$DW$T$29
    1887
    1888$C$DW$T$133     .dwtag  DW_TAG_volatile_type
    1889        .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$29)
    1890
    1891
    1892$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1893        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1894$C$DW$135       .dwtag  DW_TAG_member
    1895        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1896        .dwattr $C$DW$135, DW_AT_name("PRU1_PAD_HP_EN")
    1897        .dwattr $C$DW$135, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1898        .dwattr $C$DW$135, DW_AT_bit_offset(0x1f)
    1899        .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1900        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1902        .dwattr $C$DW$135, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1903        .dwattr $C$DW$135, DW_AT_decl_line(0xde)
    1904        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1905
    1906$C$DW$136       .dwtag  DW_TAG_member
    1907        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   36

    1908        .dwattr $C$DW$136, DW_AT_name("XFR_SHIFT_EN")
    1909        .dwattr $C$DW$136, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1910        .dwattr $C$DW$136, DW_AT_bit_offset(0x1e)
    1911        .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1912        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1914        .dwattr $C$DW$136, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1915        .dwattr $C$DW$136, DW_AT_decl_line(0xdf)
    1916        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1917
    1918$C$DW$137       .dwtag  DW_TAG_member
    1919        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1920        .dwattr $C$DW$137, DW_AT_name("rsvd2")
    1921        .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd2")
    1922        .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1923        .dwattr $C$DW$137, DW_AT_bit_size(0x1e)
    1924        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1926        .dwattr $C$DW$137, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1927        .dwattr $C$DW$137, DW_AT_decl_line(0xe0)
    1928        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1929
    1930        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1931        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1932        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1933        .dwendtag $C$DW$T$30
    1934
    1935$C$DW$T$135     .dwtag  DW_TAG_volatile_type
    1936        .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$30)
    1937
    1938
    1939$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1940        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1941$C$DW$138       .dwtag  DW_TAG_member
    1942        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1943        .dwattr $C$DW$138, DW_AT_name("PIN_MUX_SEL")
    1944        .dwattr $C$DW$138, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1945        .dwattr $C$DW$138, DW_AT_bit_offset(0x18)
    1946        .dwattr $C$DW$138, DW_AT_bit_size(0x08)
    1947        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1949        .dwattr $C$DW$138, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1950        .dwattr $C$DW$138, DW_AT_decl_line(0xec)
    1951        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1952
    1953$C$DW$139       .dwtag  DW_TAG_member
    1954        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1955        .dwattr $C$DW$139, DW_AT_name("rsvd2")
    1956        .dwattr $C$DW$139, DW_AT_TI_symbol_name("rsvd2")
    1957        .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1958        .dwattr $C$DW$139, DW_AT_bit_size(0x18)
    1959        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1961        .dwattr $C$DW$139, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1962        .dwattr $C$DW$139, DW_AT_decl_line(0xed)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   37

    1963        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1964
    1965        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    1966        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1967        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1968        .dwendtag $C$DW$T$31
    1969
    1970$C$DW$T$137     .dwtag  DW_TAG_volatile_type
    1971        .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$31)
    1972
    1973
    1974$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1975        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1976$C$DW$140       .dwtag  DW_TAG_member
    1977        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$114)
    1978        .dwattr $C$DW$140, DW_AT_name("$P$T0")
    1979        .dwattr $C$DW$140, DW_AT_TI_symbol_name("$P$T0")
    1980        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1981        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1982        .dwattr $C$DW$140, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1983        .dwattr $C$DW$140, DW_AT_decl_line(0x29)
    1984        .dwattr $C$DW$140, DW_AT_decl_column(0x02)
    1985
    1986$C$DW$141       .dwtag  DW_TAG_member
    1987        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$116)
    1988        .dwattr $C$DW$141, DW_AT_name("$P$T1")
    1989        .dwattr $C$DW$141, DW_AT_TI_symbol_name("$P$T1")
    1990        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1991        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1992        .dwattr $C$DW$141, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    1993        .dwattr $C$DW$141, DW_AT_decl_line(0x33)
    1994        .dwattr $C$DW$141, DW_AT_decl_column(0x02)
    1995
    1996$C$DW$142       .dwtag  DW_TAG_member
    1997        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$118)
    1998        .dwattr $C$DW$142, DW_AT_name("$P$T2")
    1999        .dwattr $C$DW$142, DW_AT_TI_symbol_name("$P$T2")
    2000        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2001        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2002        .dwattr $C$DW$142, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2003        .dwattr $C$DW$142, DW_AT_decl_line(0x41)
    2004        .dwattr $C$DW$142, DW_AT_decl_column(0x02)
    2005
    2006$C$DW$143       .dwtag  DW_TAG_member
    2007        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$120)
    2008        .dwattr $C$DW$143, DW_AT_name("$P$T3")
    2009        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T3")
    2010        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2011        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2012        .dwattr $C$DW$143, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2013        .dwattr $C$DW$143, DW_AT_decl_line(0x54)
    2014        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    2015
    2016$C$DW$144       .dwtag  DW_TAG_member
    2017        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$122)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   38

    2018        .dwattr $C$DW$144, DW_AT_name("$P$T4")
    2019        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T4")
    2020        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2021        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2022        .dwattr $C$DW$144, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2023        .dwattr $C$DW$144, DW_AT_decl_line(0x67)
    2024        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    2025
    2026$C$DW$145       .dwtag  DW_TAG_member
    2027        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$124)
    2028        .dwattr $C$DW$145, DW_AT_name("$P$T5")
    2029        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T5")
    2030        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2031        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2032        .dwattr $C$DW$145, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2033        .dwattr $C$DW$145, DW_AT_decl_line(0x83)
    2034        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    2035
    2036$C$DW$146       .dwtag  DW_TAG_member
    2037        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$126)
    2038        .dwattr $C$DW$146, DW_AT_name("$P$T6")
    2039        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T6")
    2040        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2041        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2042        .dwattr $C$DW$146, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2043        .dwattr $C$DW$146, DW_AT_decl_line(0x92)
    2044        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    2045
    2046$C$DW$147       .dwtag  DW_TAG_member
    2047        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$128)
    2048        .dwattr $C$DW$147, DW_AT_name("$P$T7")
    2049        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T7")
    2050        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2051        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2052        .dwattr $C$DW$147, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2053        .dwattr $C$DW$147, DW_AT_decl_line(0xa0)
    2054        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2055
    2056$C$DW$148       .dwtag  DW_TAG_member
    2057        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$130)
    2058        .dwattr $C$DW$148, DW_AT_name("$P$T8")
    2059        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T8")
    2060        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2061        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2062        .dwattr $C$DW$148, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2063        .dwattr $C$DW$148, DW_AT_decl_line(0xaf)
    2064        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2065
    2066$C$DW$149       .dwtag  DW_TAG_member
    2067        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
    2068        .dwattr $C$DW$149, DW_AT_name("rsvd24")
    2069        .dwattr $C$DW$149, DW_AT_TI_symbol_name("rsvd24")
    2070        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2071        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2072        .dwattr $C$DW$149, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   39

    2073        .dwattr $C$DW$149, DW_AT_decl_line(0xbc)
    2074        .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    2075
    2076$C$DW$150       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$132)
    2078        .dwattr $C$DW$150, DW_AT_name("$P$T9")
    2079        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T9")
    2080        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2081        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$150, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2083        .dwattr $C$DW$150, DW_AT_decl_line(0xc0)
    2084        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2085
    2086$C$DW$151       .dwtag  DW_TAG_member
    2087        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$33)
    2088        .dwattr $C$DW$151, DW_AT_name("rsvd2c")
    2089        .dwattr $C$DW$151, DW_AT_TI_symbol_name("rsvd2c")
    2090        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2091        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2092        .dwattr $C$DW$151, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2093        .dwattr $C$DW$151, DW_AT_decl_line(0xcb)
    2094        .dwattr $C$DW$151, DW_AT_decl_column(0x0b)
    2095
    2096$C$DW$152       .dwtag  DW_TAG_member
    2097        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$134)
    2098        .dwattr $C$DW$152, DW_AT_name("$P$T10")
    2099        .dwattr $C$DW$152, DW_AT_TI_symbol_name("$P$T10")
    2100        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2101        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2102        .dwattr $C$DW$152, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2103        .dwattr $C$DW$152, DW_AT_decl_line(0xcf)
    2104        .dwattr $C$DW$152, DW_AT_decl_column(0x02)
    2105
    2106$C$DW$153       .dwtag  DW_TAG_member
    2107        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$136)
    2108        .dwattr $C$DW$153, DW_AT_name("$P$T11")
    2109        .dwattr $C$DW$153, DW_AT_TI_symbol_name("$P$T11")
    2110        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2111        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2112        .dwattr $C$DW$153, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2113        .dwattr $C$DW$153, DW_AT_decl_line(0xda)
    2114        .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    2115
    2116$C$DW$154       .dwtag  DW_TAG_member
    2117        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$34)
    2118        .dwattr $C$DW$154, DW_AT_name("rsvd38")
    2119        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd38")
    2120        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2121        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2122        .dwattr $C$DW$154, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2123        .dwattr $C$DW$154, DW_AT_decl_line(0xe5)
    2124        .dwattr $C$DW$154, DW_AT_decl_column(0x0b)
    2125
    2126$C$DW$155       .dwtag  DW_TAG_member
    2127        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$138)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   40

    2128        .dwattr $C$DW$155, DW_AT_name("$P$T12")
    2129        .dwattr $C$DW$155, DW_AT_TI_symbol_name("$P$T12")
    2130        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2131        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2132        .dwattr $C$DW$155, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2133        .dwattr $C$DW$155, DW_AT_decl_line(0xe8)
    2134        .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    2135
    2136        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2137        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2138        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2139        .dwendtag $C$DW$T$35
    2140
    2141$C$DW$T$294     .dwtag  DW_TAG_typedef
    2142        .dwattr $C$DW$T$294, DW_AT_name("pruCfg")
    2143        .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$35)
    2144        .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
    2145        .dwattr $C$DW$T$294, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335
    2146        .dwattr $C$DW$T$294, DW_AT_decl_line(0xf0)
    2147        .dwattr $C$DW$T$294, DW_AT_decl_column(0x03)
    2148
    2149$C$DW$T$295     .dwtag  DW_TAG_volatile_type
    2150        .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$294)
    2151
    2152
    2153$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2154        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2155$C$DW$156       .dwtag  DW_TAG_member
    2156        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
    2157        .dwattr $C$DW$156, DW_AT_name("REV_MINOR")
    2158        .dwattr $C$DW$156, DW_AT_TI_symbol_name("REV_MINOR")
    2159        .dwattr $C$DW$156, DW_AT_bit_offset(0x1a)
    2160        .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2161        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2163        .dwattr $C$DW$156, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2164        .dwattr $C$DW$156, DW_AT_decl_line(0x2d)
    2165        .dwattr $C$DW$156, DW_AT_decl_column(0x0d)
    2166
    2167$C$DW$157       .dwtag  DW_TAG_member
    2168        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2169        .dwattr $C$DW$157, DW_AT_name("REV_CUSTOM")
    2170        .dwattr $C$DW$157, DW_AT_TI_symbol_name("REV_CUSTOM")
    2171        .dwattr $C$DW$157, DW_AT_bit_offset(0x18)
    2172        .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2173        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2175        .dwattr $C$DW$157, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2176        .dwattr $C$DW$157, DW_AT_decl_line(0x2e)
    2177        .dwattr $C$DW$157, DW_AT_decl_column(0x0d)
    2178
    2179$C$DW$158       .dwtag  DW_TAG_member
    2180        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2181        .dwattr $C$DW$158, DW_AT_name("REV_MAJOR")
    2182        .dwattr $C$DW$158, DW_AT_TI_symbol_name("REV_MAJOR")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   41

    2183        .dwattr $C$DW$158, DW_AT_bit_offset(0x15)
    2184        .dwattr $C$DW$158, DW_AT_bit_size(0x03)
    2185        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2187        .dwattr $C$DW$158, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2188        .dwattr $C$DW$158, DW_AT_decl_line(0x2f)
    2189        .dwattr $C$DW$158, DW_AT_decl_column(0x0d)
    2190
    2191$C$DW$159       .dwtag  DW_TAG_member
    2192        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2193        .dwattr $C$DW$159, DW_AT_name("REV_RTL")
    2194        .dwattr $C$DW$159, DW_AT_TI_symbol_name("REV_RTL")
    2195        .dwattr $C$DW$159, DW_AT_bit_offset(0x10)
    2196        .dwattr $C$DW$159, DW_AT_bit_size(0x05)
    2197        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2199        .dwattr $C$DW$159, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2200        .dwattr $C$DW$159, DW_AT_decl_line(0x30)
    2201        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2202
    2203$C$DW$160       .dwtag  DW_TAG_member
    2204        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2205        .dwattr $C$DW$160, DW_AT_name("REV_MODULE")
    2206        .dwattr $C$DW$160, DW_AT_TI_symbol_name("REV_MODULE")
    2207        .dwattr $C$DW$160, DW_AT_bit_offset(0x04)
    2208        .dwattr $C$DW$160, DW_AT_bit_size(0x0c)
    2209        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2211        .dwattr $C$DW$160, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2212        .dwattr $C$DW$160, DW_AT_decl_line(0x31)
    2213        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2214
    2215$C$DW$161       .dwtag  DW_TAG_member
    2216        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2217        .dwattr $C$DW$161, DW_AT_name("rsvd28")
    2218        .dwattr $C$DW$161, DW_AT_TI_symbol_name("rsvd28")
    2219        .dwattr $C$DW$161, DW_AT_bit_offset(0x02)
    2220        .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    2221        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2223        .dwattr $C$DW$161, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2224        .dwattr $C$DW$161, DW_AT_decl_line(0x32)
    2225        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2226
    2227$C$DW$162       .dwtag  DW_TAG_member
    2228        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2229        .dwattr $C$DW$162, DW_AT_name("REV_SCHEME")
    2230        .dwattr $C$DW$162, DW_AT_TI_symbol_name("REV_SCHEME")
    2231        .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2232        .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2233        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2235        .dwattr $C$DW$162, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2236        .dwattr $C$DW$162, DW_AT_decl_line(0x33)
    2237        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   42

    2238
    2239        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2240        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2241        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2242        .dwendtag $C$DW$T$36
    2243
    2244$C$DW$T$139     .dwtag  DW_TAG_volatile_type
    2245        .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$36)
    2246
    2247
    2248$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2249        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2250$C$DW$163       .dwtag  DW_TAG_member
    2251        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2252        .dwattr $C$DW$163, DW_AT_name("rsvd0")
    2253        .dwattr $C$DW$163, DW_AT_TI_symbol_name("rsvd0")
    2254        .dwattr $C$DW$163, DW_AT_bit_offset(0x1e)
    2255        .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2256        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2258        .dwattr $C$DW$163, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2259        .dwattr $C$DW$163, DW_AT_decl_line(0x3d)
    2260        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2261
    2262$C$DW$164       .dwtag  DW_TAG_member
    2263        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2264        .dwattr $C$DW$164, DW_AT_name("NEST_MODE")
    2265        .dwattr $C$DW$164, DW_AT_TI_symbol_name("NEST_MODE")
    2266        .dwattr $C$DW$164, DW_AT_bit_offset(0x1c)
    2267        .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    2268        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2270        .dwattr $C$DW$164, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2271        .dwattr $C$DW$164, DW_AT_decl_line(0x3e)
    2272        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2273
    2274$C$DW$165       .dwtag  DW_TAG_member
    2275        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2276        .dwattr $C$DW$165, DW_AT_name("rsvd4")
    2277        .dwattr $C$DW$165, DW_AT_TI_symbol_name("rsvd4")
    2278        .dwattr $C$DW$165, DW_AT_bit_offset(0x00)
    2279        .dwattr $C$DW$165, DW_AT_bit_size(0x1c)
    2280        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2282        .dwattr $C$DW$165, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2283        .dwattr $C$DW$165, DW_AT_decl_line(0x3f)
    2284        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2285
    2286        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2287        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2288        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2289        .dwendtag $C$DW$T$37
    2290
    2291$C$DW$T$141     .dwtag  DW_TAG_volatile_type
    2292        .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$37)
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   43

    2293
    2294
    2295$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2296        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2297$C$DW$166       .dwtag  DW_TAG_member
    2298        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2299        .dwattr $C$DW$166, DW_AT_name("EN_HINT_ANY")
    2300        .dwattr $C$DW$166, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2301        .dwattr $C$DW$166, DW_AT_bit_offset(0x1f)
    2302        .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2303        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2304        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2305        .dwattr $C$DW$166, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2306        .dwattr $C$DW$166, DW_AT_decl_line(0x4c)
    2307        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2308
    2309$C$DW$167       .dwtag  DW_TAG_member
    2310        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2311        .dwattr $C$DW$167, DW_AT_name("rsvd1")
    2312        .dwattr $C$DW$167, DW_AT_TI_symbol_name("rsvd1")
    2313        .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2314        .dwattr $C$DW$167, DW_AT_bit_size(0x1f)
    2315        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2317        .dwattr $C$DW$167, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2318        .dwattr $C$DW$167, DW_AT_decl_line(0x4d)
    2319        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2320
    2321        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x
    2322        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2323        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2324        .dwendtag $C$DW$T$38
    2325
    2326$C$DW$T$143     .dwtag  DW_TAG_volatile_type
    2327        .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$38)
    2328
    2329
    2330$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2331        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2332$C$DW$168       .dwtag  DW_TAG_member
    2333        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2334        .dwattr $C$DW$168, DW_AT_name("GLB_NEST_LEVEL")
    2335        .dwattr $C$DW$168, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2336        .dwattr $C$DW$168, DW_AT_bit_offset(0x17)
    2337        .dwattr $C$DW$168, DW_AT_bit_size(0x09)
    2338        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2340        .dwattr $C$DW$168, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2341        .dwattr $C$DW$168, DW_AT_decl_line(0x5a)
    2342        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2343
    2344$C$DW$169       .dwtag  DW_TAG_member
    2345        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2346        .dwattr $C$DW$169, DW_AT_name("rsvd9")
    2347        .dwattr $C$DW$169, DW_AT_TI_symbol_name("rsvd9")
PRU Assembler Unix v2.3.3 Wed Aug 12 00:15:05 2020

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
gen/pru0_mcp3208_rpmsg.asm                                           PAGE   44

    2348        .dwattr $C$DW$169, DW_AT_bit_offset(0x01)
    2349        .dwattr $C$DW$169, DW_AT_bit_size(0x16)
    2350        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2352        .dwattr $C$DW$169, DW_AT_decl_file("/usr/share/ti/pru-software-support-package/include/am335x/
    2353        .dwattr $C$DW$169, DW_AT_decl_line(0x5b)
    2354        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2355
